{
    "title": "Minha biblioteca.bib",
    "text": "@misc{20thWCPHeidegger,\n  title = {20th {{WCP}}: {{Heidegger}}'s {{Reading}} of {{Descartes}}' {{Dualism}}: {{The Relation}} of {{Subject}} and {{Object}}},\n  urldate = {2024-04-11},\n  howpublished = {https://www.bu.edu/wcp/Papers/Cont/ContCuce.htm},\n  file = {E:\\Zotero\\storage\\JDVXE2JE\\ContCuce.html}\n}\n\n@article{ahrensHowTakeSmart,\n  title = {How to {{Take Smart Notes}}: {{One Simple Technique}} to {{Boost Writing}}, {{Learning}} and {{Thinking}} {\\textendash} for {{Students}}, {{Academics}} and {{Nonfiction Book Writers}}},\n  author = {Ahrens, S{\\\"o}nke},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\6ETUU4VU\\Ahrens - How to Take Smart Notes One Simple Technique to B.pdf}\n}\n\n@book{alexanderBook1NatureOrder2022,\n  title = {[{{Book1}}]{{The Nature}} of {{Order The Phenomenon}} of {{Life}}},\n  shorttitle = {The {{Nature}} of {{Order}}, {{Book One}}},\n  author = {Alexander, Christopher},\n  year = {2022},\n  publisher = {{Eurospan}},\n  abstract = {Christopher Alexander's series of ground-breaking books including A Pattern Language and The Timeless Way of Building have pointed to fundamental truths of the way we build, revealing what gives life and beauty and true functionality to our buildings and towns. Now, in The Nature of Order, Alexander explores the properties of life itself, highlighting a set of well-defined structures present in all order and in all life from micro-organisms and mountain ranges to good houses and vibrant communities.In The Phenomenon of Life, the first volume in this four volume masterwork, Alexander proposes a scientific view of the world in which all space-matter has perceptible degrees of life and sets this understanding of order as an intellectual basis for a new architecture. With this view as a foundation, we can ask precise questions about what must be done to create more life in our world whether in a rooma humble doorknoba neighbourhoodor even in a vast region.He introduces the concept of living structure, basing it upon his theories of centres and of wholeness, and defines the fifteen properties from which, according to his observations, all wholeness is built. Alexander argues that living structure is at once both personal and structural.Taken as a whole, the four books create a sweeping new conception of the nature of things which is both objective and structural (hence part of science) and also personal (in that it shows how and why things have the power to touch the human heart). A step has been taken, through which these two domains the domain of geometrical structure and the feeling it creates kept separate during four centuries of scientific though from 1600 to 2000, have finally been united.The Nature of Order constitutes the backbone of Building Beauty: Ecologic Design Construction Process, an initiative aimed at radically reforming architecture education, with the emphasis of making as a way to access a transformative vision of the world. The 15 fundamental properties of life guide our work and have given us much more than a set of solutions. The Nature of Order has given us the framework in which we can search and build up our own solutions.In order to be authentically sustainable, buildings and places have to be cared for and loved over generations. Beautiful buildings and places are more likely to be loved, and they become more beautiful, and loved, through the attention given to them over time. Beauty is therefore, not a luxury, or an option, it includes and transcends technological innovation, and is a necessary requirement for a truly sustainable culture.'Dr. Sergio Porta, International Director, Building Beauty ( www.buildingbeauty.org)Professor of Urban Design, Director of Urban Design Studies Unit, and Director of Masters in Urban Design, University of Strathclyde EPUB3: Fixed format [Elib]},\n  isbn = {978-1-73507-810-6},\n  langid = {english},\n  annotation = {OCLC: 1296105324},\n  file = {E:\\Zotero\\storage\\SY6R7YEF\\TWB_(The Nature of Order) Christopher Alexander - The Phenomenon of Life_ Nature of Order,  Book 1_ An Essay on the Art of Building and the Nature of the Universe (The Nature of Order)-CES Publishing (200.pdf}\n}\n\n@book{alexanderBook2ProcessCreating2002,\n  title = {[{{Book2}}]{{The}} Process of Creating Life: An Essay on the Art of Building and the Nature of the Universe},\n  shorttitle = {The Process of Creating Life},\n  author = {Alexander, Christopher and Alexander, Christopher},\n  year = {2002},\n  series = {The {{Center}} for {{Environmental Structure}} Series},\n  number = {v. 10},\n  publisher = {{Center for Environmental Structure}},\n  address = {{Berkeley, Calif}},\n  collaborator = {{Center for Environmental Structure}},\n  isbn = {978-0-9726529-0-2 978-0-9726529-2-6},\n  lccn = {NA2500 .A448 2002},\n  keywords = {Architectural design,Architecture,Architecture and philosophy,Color (Philosophy),Cosmology,Life,Philosophy},\n  note = {(Alexander e Alexander, 2002, p. 24)\n\\par\nApesa do progresso feito nas ci{\\^e}ncias e nas humanas. O conceito de processo n{\\~a}o se tornou parte do nosso modo de pensar a arquitetura. Nossa vis{\\~a}o atual da arquitetura carrega pouca consci{\\^e}ncia do devir como recurso mais essencial do processo construtivo.\n\\par\nArquitetos est{\\~a}o concentrados demais no design do mundo ( sua estrutura est{\\'a}tica) e n{\\~a}o o suficiente com o design do processo generativo que cria o mundo (sua estrutura dinamica).\n\\par\n(Alexander e Alexander, 2002, p. 33)\n\\par\nEm ultima inst{\\^a}ncia, ``Eu n{\\~a}o me responsabilizo, estou apenas fazendo o meu trabalho.''\n\\par\nO sentido de fazer aqui n{\\~a}o se atribui ao fato de que estamos, com as nossas pr{\\'o}prias m{\\~a}os, erguendo cada parede. Isso n{\\~a}o {\\'e} poss{\\'i}vel a n{\\~a}o ser nos menores casos, de pequenas casas. O que est{\\'a} sendo proposto {\\'e} que todos envolvidos no processo se considerem respons{\\'a}veis pelo todo, n{\\~a}o s{\\'o} por sua fun{\\c c}{\\~a}o individual. Um todo que emerge pela intencionalidade compartilhada est{\\'a} fadado a ser mais completo. Sem essa compreen{\\c c}{\\~a}o holistica e participativa {\\'e} imposs{\\'i}vel o desdobramento de uma totalidade, pois cada passo fragmenta a unicidade.\n\\par\n(Alexander e Alexander, 2002, p. 261)\n\\par\nUnpredictability\n\\par\nButterfly effect. Quando observamos um sistema natural complexo evoluindo, cada estagio posterior depende do estado anterior.\n\\par\nA ci{\\^e}ncia mecanicista do s{\\'e}c 19 criou um modelo de pensamento em que fazia parecer que cada estagio poderia ser facilmente previsto de um estagio anterior. Mas acontece que o mundo n{\\~a}o {\\'e} como esse modelo mecanicista. Descobertas mais sofisticadas tornaram claro que, em um sistema complexo, o pr{\\'o}ximo est{\\'a}gio {\\'e} inteiramente dependente da configura{\\c c}{\\~a}o do todo, que depende de min{\\'u}cias sutis na historia dos todos anteriores. N{\\~a}o existe uma maneira precisa de predizer o camingo de um sistema emergente com anteced{\\^e}ncia.\n\\par\n(Alexander e Alexander, 2002, p. 261)\n\\par\n(Alexander e Alexander, 2002, p. 364)\n\\par\nThis is a revision of the pattern theory.\n\\par\n\\textbf{All Buildings As Making}\n\\par\n(Alexander e Alexander, 2002, p. 539)\n\\par\n(Alexander e Alexander, 2005, p. 501)\n\\par\n\\section{Anota{\\c c}{\\~o}es\\\\\n(25/03/2024 19:34:16)}\n\n\\par\n(Alexander e Alexander, 2002, p. 81)\n\\par\n(Alexander e Alexander, 2002, p. 104) Creative Power Children\n\\par\n(Alexander e Alexander, 2002, p. 107) Gestalt\n\\par\n(Alexander e Alexander, 2002, p. 112) Immediate Feedback and Good Fit\n\\par\n(Alexander e Alexander, 2002, p. 156) Creativity is about enhancing existing\n\\par\n(Alexander e Alexander, 2002, p. 181)\n\\par\n(Alexander e Alexander, 2002, p. 194)\n\\par\n(Alexander e Alexander, 2002, p. 196)\n\\par\n(Alexander e Alexander, 2002, p. 211) Continue Here\n\\par\n(Alexander e Alexander, 2002, p. 338)\n\\par\n(Alexander e Alexander, 2002, p. 433)\n\\par\n(Alexander e Alexander, 2002, p. 457)\n\\par\n(Alexander e Alexander, 2002, p. 458)\n\\par\n(Alexander e Alexander, 2002, p. 462)\n\\par\n(Alexander e Alexander, 2002, p. 480)\n\\par\n(Alexander e Alexander, 2002, p. 502)\n\\par\n(Alexander e Alexander, 2002, p. 526)\n\\par\n(Alexander e Alexander, 2002, p. 551) LER ESSE CAP{\\'I}TULO!\\\\\nChapter Twenty\n\\par\n(Alexander e Alexander, 2002, p. 564)\n\\par\nBeauty would be the physical manifestation of a coherent process. We are drawn in to the internal complexity of things.\n\\par\nEnt{\\~a}o qual {\\'e} o processo que alcan{\\c c}a essa s{\\'u}til adapta{\\c c}{\\~a}o das partes que nos revela uma arquitetura viva?\n\\par\n(Alexander e Alexander, 2002, p. 23)\n\\par\nMuitos dos processos usados hoje, infelizmente, est{\\~a}o fadados ao fracasso. Eles s{\\~a}o o que s{\\~a}o precisamente em fun{\\c c}{\\~a}o dos processos sociais que os conceberam, planejaram e constru{\\'i}ram.\n\\par\nDentro dessa ocular, o processo desempenha um papel mais fundamental em determinar a vida ou morte da constru{\\c c}{\\~a}o que o ``design'', n{\\~a}o importa o qu{\\~a}o talentoso seja o indiv{\\'i}duo, se o processo utilizado estiver errado, o design n{\\~a}o poder{\\'a} salvar o projeto.\n\\par\nMechanized Process.\n\\par\nConsidere o processo ``normal'' de concep{\\c c}{\\~a}o construtiva. O programa segue uma rotina. O cliente especifica um programa em que as {\\'a}reas da constru{\\c c}{\\~a}o s{\\~a}o separadas mecanicamente como requerimentos. No caso de uma edifica{\\c c}{\\~a}o grande, esse programa se torna mais preciso( e frequentemente mais r{\\'i}gido) por um profissional especializado que estabelece aritmeticamente em uma tabela de metragem quadrada. O arquiteto planeja a edifica{\\c c}{\\~a}o por meio de um desenho descritivo que se adequa ao programa. Os desenhos s{\\~a}o verificados por um engenheiro que est{\\'a} separado do processo e cuja {\\'u}nica fun{\\c c}{\\~a}o {\\'e} garantir que a constru{\\c c}{\\~a}o se mantenha de p{\\'e}. Um engenheiro de solo possivelmente trabalha nas funda{\\c c}{\\~o}es, separadamente. O projeto estrutural {\\'e} checado por um inspetor em outro processo separado. Uma vez que os desenhos s{\\~a}o aprovados, eles s{\\~a}o levados para licita{\\c c}{\\~a}o, por um empreiteiro que n{\\~a}o fez parte do processo de design. Este olha para os desenho, mas n{\\~a}o compartilha nenhuma vis{\\~a}o em comum com os profissionais que participaram das demais etapas.\n\\par\nAs partes individuais do desenho podem ser delegadas para sub-empreiteiros que est{\\~a}o ainda mais remotos da tarefa em andamento.\n\\par\nMuitos dos objetos que ser{\\~a}o utilizados na constru{\\c c}{\\~a}o s{\\~a}o produzidos na f{\\'a}brica. Eles foram desenhados e construidos sem rela{\\c c}{\\~a}o alguma com a edifica{\\c c}{\\~a}o , e s{\\~a}o colocados juntos apenas por um processo de montagem.\n\\par\nDurante o processo, corre{\\c c}{\\~o}es n{\\~a}o podem ser feitas sem que haja um grande preju{\\'i}zo para o cliente. O processo de montagem {\\'e} insensivel para qualquer potencial emergente durante a constru{\\c c}{\\~a}o. Ainda n{\\~a}o citamos outras categorias como paisagismo e o interior, que tamb{\\'e}m s{\\~a}o delegadas {\\`a} um arquiteto separado, especializado em plantas. A planta{\\c c}{\\~a}o de fato {\\'e} feita por outro individuo, que ir{\\'a} apenas seguir o mapeamento determinado no computador.\n\\par\nO designer de interiores , tamb{\\'e}m removido de todas as outras realidades anteriores, vai trazer componentes pre-construidos na tentativa de produzir um comodo coer{\\^e}nte.\n\\par\n[[Trojan Horse]]\n\\par\nOs verdadeiros ocupantes at{\\'e} tentam participar do processo, mas s{\\~a}o considerados pelos profissionais como um impec{\\'i}lio, interferfer{\\^e}ncias que a todo tempo atrasam e vetam a concretiza{\\c c}{\\~a}o idealizada que os profissionais, apegados as suas pr{\\'o}prias concep{\\c c}{\\~o}es e reputa{\\c c}{\\~o}es, tentam impor com tanta convic{\\c c}{\\~a}o.\n\\par\n``Mas isso tudo ainda {\\'e} um processo,n{\\~a}o?'' O problema {\\'e} que {\\'e} um processo puramente mec{\\^a}nico que subverte o fogo interno de um processo org{\\^a}nico de adapta{\\c c}{\\~a}o.\n\\par\nEm uma vis{\\~a}o de mundo mecanicista, n{\\'o}s vemos todas as coisas, mesmo que por conveniencia, como maquinas. Uma maquina {\\'e} orientada por objetivos. Portanto os processos que ocorrem dentro dessa vis{\\~a}o de mundo s{\\~a}o tamb{\\'e}m sempre valorizados em termos da sua finalidade.\n\\par\nA sociologia mecanicista do s{\\'e}culo XX v{\\^e} at{\\'e} mesmo gentileza como um meio para atingir certos resultados, como uma barganha por um contrato social, com o prop{\\'o}sito de alcan{\\c c}ar algo. Perdemos o contato com a dinamicidade dos jogos infinitos, onde os objetivos s{\\~a}o auto-contidos e a a{\\c c}{\\~a}o {\\'e} a pr{\\'o}pria raz{\\~a}o de ser. Em uma vis{\\~a}o procedural, ao contrario da vis{\\~a}o orientada a objetivos, um processo encontra em si mesmo a sua necessidade. Gentileza nasce na necessidade existente minuto-a-minuto de se importar, dinamicamente, pelos sentimentos e bem estar do outro. N{\\~a}o se prev{\\^e} um resultado final\n\\par\nOrdem como devir.\n\\par\n(Alexander e Alexander, 2002, p. 24)\n\\par\nNa biologia a estrutura de um organismo {\\'e} insepar{\\'a}vel do processo que o cria e o mant{\\'e}m.\n\\par\nUm animal, a qualquer instante, {\\'e} o resultado cont{\\'i}nuo dos processos que criam o organismo, e continuam criando ao longo de sua vida.\n\\par\nA flor {\\'e} o produto temporario da semente e do broto sob a influ{\\^e}ncia do DNA.\n\\par\nSempre, todo o sistema ordenado que v{\\^e}mos {\\'e} apenas uma se{\\c c}{\\~a}o transversal no tempo, de um resultado cont{\\'i}nuo de fluxo e mudan{\\c c}a.},\n  file = {E:\\Zotero\\storage\\XGGN5533\\Alexander e Alexander - 2002 - [Book2]The process of creating life an essay on t.pdf}\n}\n\n@book{alexanderBook3VisionLiving2005,\n  title = {[{{Book3}}]{{A}} Vision of a Living World: An Essay on the Art of Building and the Nature of the Universe},\n  shorttitle = {A Vision of a Living World},\n  author = {Alexander, Christopher and Alexander, Christopher},\n  year = {2005},\n  series = {The {{Center}} for {{Environmental Structure}} Series},\n  number = {v. 11},\n  publisher = {{Center for Environmental Structure}},\n  address = {{Berkeley, Calif}},\n  collaborator = {{Center for Environmental Structure}},\n  isbn = {978-0-9726529-0-2 978-0-9726529-3-3},\n  lccn = {NA2750 .A54 2005},\n  keywords = {Architectural design,Architecture,Case studies,Philosophy},\n  file = {E:\\Zotero\\storage\\ZTCFIEGR\\A Vision of a Living World_ The Nature of Order, Book 3_ An Essay on the Art of Building and the -- Christopher Alexander -- The Nature of Order, 2004 -- Center for Environmental Structure -- 9780972652919 -.pdf}\n}\n\n@book{alexanderBook4LuminousGround2004,\n  title = {[{{Book4}}]{{The}} Luminous Ground: An Essay on the Art of Building and the Nature of the Universe},\n  shorttitle = {The Luminous Ground},\n  author = {Alexander, Christopher and Alexander, Christopher},\n  year = {2004},\n  series = {The {{Center}} for {{Environmental Structure}} Series},\n  number = {v. 12},\n  publisher = {{Center for Environmental Structure}},\n  address = {{Berkeley, Calif}},\n  collaborator = {{Center for Environmental Structure}},\n  isbn = {978-0-9726529-0-2 978-0-9726529-4-0},\n  lccn = {NA2500 .A443 2004},\n  keywords = {Architecture and philosophy,Color (Philosophy),Cosmology},\n  file = {E:\\Zotero\\storage\\2WYUSUBX\\The Luminous Ground_ The Nature of Order, Book 4_ An Essay -- Christopher Alexander -- The Nature of Order, 2003 -- CES Publishing -- 9780972652940 -- 732639a04eed28fa1fd01991af5b57c5 -- Anna’s Archive.pdf}\n}\n\n@article{alexanderCITYNOTTREE,\n  title = {A {{CITY IS NOT A TREE}}},\n  author = {Alexander, Christopher},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\V6K3ZURK\\Alexander - A CITY IS NOT A TREE.pdf}\n}\n\n@book{alexanderCityNotTree2015,\n  title = {A City Is Not a Tree},\n  author = {Alexander, Christopher},\n  editor = {Mehaffy, Michael W.},\n  year = {2015},\n  edition = {50th anniversary edition},\n  publisher = {{Sustasis Press}},\n  address = {{Portland, Oregon}},\n  abstract = {In 1965, the architect and design theorist Christopher Alexander published a landmark theoretical critique of modern urban design, and by extension, modern design in general. His critique was different from others of the day in that it was not based on a social or political argument, but rather, on a structural analysis, rooted in then-emerging insights from the fields of mathematics and cognition. Here, published again on its fiftieth anniversary, is Alexander's classic text, together with new interpretive commentaries and discussions by leading theorists and practitioners. This volume is destined to become an invaluable resource for a new generation of students and practitioners},\n  isbn = {978-0-9893469-7-9},\n  langid = {english},\n  annotation = {OCLC: 953971320},\n  file = {E:\\Zotero\\storage\\3K7KMEML\\Alexander - 2015 - A city is not a tree.pdf}\n}\n\n@article{alexanderGenerativeCode,\n  title = {Generative {{Code}} For},\n  author = {Alexander, Christopher},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\YDVXSFIL\\Alexander - Generative Code for.pdf}\n}\n\n@article{alexanderLifeBeautyEarth2010,\n  title = {For the {{Life}} and {{Beauty}} of the {{Earth}}},\n  author = {Alexander, Christopher},\n  year = {2010},\n  langid = {english},\n  note = {\\textbf{TAYLORISM}\n\\par\n``I believe that this has arisen because during the 20th century, the production process itself {\\textemdash} the step-by-step acts that bring a building into being {\\textemdash} were largely modeled on Taylorian notions 2'' (Alexander, p. 25)\n\\par\n(Alexander e Alexander, 2002, p. 535)\n\\par\n``There are, loosely speaking, two types of building production. Type (A) is a type of production which relies on feedback and correction, so that every step allows the elements to be perfected while they are being made. This is not unlike the way a good cook tastes a soup while cooking it, checking it, modifying it until it tastes just right. Type (B) is a type of production that is organized by a fixed system of rigidly prefabricated elements, and the sequence of assembly is much more rigidly preprogrammed. `This type became commonplace in the 20th century, and is still widely used.'' (Alexander, 2010, p. 19)},\n  file = {E:\\Zotero\\storage\\VZAEXD6Y\\Alexander - for the Life and Beauty of the Earth.pdf}\n}\n\n@book{alexanderNotesSynthesisForm1979,\n  title = {Notes on the Synthesis of Form},\n  author = {Alexander, Christopher},\n  year = {1979},\n  edition = {10. print},\n  publisher = {{Harvard University Press}},\n  address = {{Cambridge}},\n  isbn = {978-0-674-62750-5 978-0-674-62751-2},\n  langid = {english},\n  note = {``These principles are at the root of all so-called \"theories\" of archi\\- tectural design.12 They are prescriptions which relieve the burden of selfconsciousness and of too much responsibility'' (Alexander, 1979, p. 62)\n\\par\nPrincipios s{\\~a}o a raiz das Teorias. Prescri{\\c c}{\\~o}es que aliviam o fardo da autoconsciencia de tanta responsabilidade.\n\\par\n``If the selfconscious culture relies on the individual to produce its forms, and the individual isn't up to it, there seems nothing more to say. But it is not so simple. The individual is not merely weak. The moment he becomes aware of his own weakness in the face of the enormous challenge of a new design problem, he takes steps to overcome his weakness ; and strangely enough these steps themselves exert a very positive bad influence on the way he develops 5'' (Alexander, 1979, pp. -)\n\\par\n``forms. In fact, we shall see that the selfconscious system's lack of success really doesn't lie so much in the individual's lack of capacity as in the kind of efforts he makes, when he is selfconscious, to overcome this incapacity.'' (Alexander, 1979, p. 60)\n\\par\nCONCEITOS N{\\~A}O AJUDAM!\n\\par\n``These concepts will not help the designer in finding a well-adapted solution unless they happen to correspond to the system's subsystems.'' (Alexander, 1979, p. 65)\n\\par\n(Alexander, 1979, p. 66)\n\\par\n``consults a consultant now and then when faced by extra-special difficulties, and introduces this randomly selected information into forms otherwise dreamt up in the artist's studio of his mind'' (Alexander, 1979, p. 4)\n\\par\n``. The technical difficulties of grasping all the information needed for the construction of such a form are out of hand - and well beyond the fingers of a single individual.'' (Alexander, 1979, p. 4)\n\\par\nKatarani on difficulties of communication\n\\par\n``In the first case we can quite easily do it in our heads. In the second case, the complexity of the problem will defeat us unless we find a simple way of writing it down, which lets us break it into smaller problems.'' (Alexander, 1979, p. 3)\n\\par\nA diferen{\\c c}a entre problemas complexos e simples {\\'e} a necessidade de um auxilio mental externalizado.\n\\par\n``This directness is the second crucial feature of the unself\\- conscious system's form-production. Failure and correction go side by side. There is no deliberation in between the recognition of a failure and the reaction to it.22 The directness is enhanced, too, by the fact that building and repair are so much an everyday affair'' (Alexander, 1979, p. 50)},\n  file = {E:\\Zotero\\storage\\324ZA4Y5\\Notes on the Synthesis of Form -- Christopher Alexander -- Harvard Paperbacks, Seventh Printing, 1973, 1964 -- Harvard University Press -- daf4142f1b3496c445d9d253873a12a3 -- Anna’s Archive.pdf}\n}\n\n@book{alexanderOregonExperiment1975,\n  title = {The {{Oregon}} Experiment},\n  editor = {Alexander, Christopher},\n  year = {1975},\n  series = {Center for {{Environmental Structure}} Series},\n  number = {3},\n  publisher = {{Oxford Univ. Press}},\n  address = {{New York, NY}},\n  isbn = {978-0-19-501824-0},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\QXF7QHY4\\Alexander - 1975 - The Oregon experiment.pdf}\n}\n\n@article{alexanderORIGINCREATIVEPOWER1962,\n  title = {{{THE ORIGIN OF CREATIVE POWER IN CHILDREN}}},\n  author = {Alexander, Christopher},\n  year = {1962},\n  journal = {The British Journal of Aesthetics},\n  volume = {2},\n  number = {3},\n  pages = {207--226},\n  issn = {0007-0904, 1468-2842},\n  doi = {10.1093/bjaesthetics/2.3.207},\n  urldate = {2023-09-23},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\LETY27M8\\Alexander - 1962 - THE ORIGIN OF CREATIVE POWER IN CHILDREN.pdf}\n}\n\n@article{alexanderOriginsPatternTheory1999,\n  title = {The Origins of Pattern Theory: The Future of the Theory, and the Generation of a Living World},\n  shorttitle = {The Origins of Pattern Theory},\n  author = {Alexander, C.},\n  year = {Sept.-Oct./1999},\n  journal = {IEEE Software},\n  volume = {16},\n  number = {5},\n  pages = {71--82},\n  issn = {07407459},\n  doi = {10.1109/52.795104},\n  urldate = {2023-09-09},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\V5JAGV9L\\Alexander - 1999 - The origins of pattern theory the future of the t.pdf}\n}\n\n@book{alexanderProductionHouses1985,\n  title = {The Production of Houses},\n  author = {Alexander, Christopher and Davis, Howard and Martinez, Julio and Corner, Donald},\n  year = {1985},\n  publisher = {{Oxford University Press}},\n  address = {{New York}},\n  isbn = {978-0-19-503223-9},\n  langid = {english},\n  lccn = {TH4811 .A46 1985},\n  keywords = {House construction},\n  file = {E:\\Zotero\\storage\\KUZW46F9\\Alexander et al. - 1985 - The production of houses.pdf}\n}\n\n@book{alexanderTimelessWayBuilding1979,\n  title = {The Timeless Way of Building},\n  author = {Alexander, Christopher},\n  year = {1979},\n  edition = {8th printing},\n  publisher = {{Oxford Univ. Pr}},\n  address = {{New York}},\n  isbn = {978-0-19-502402-9},\n  note = {``Of course the patterns vary from place to place, from culture to culture, from age to age; they are all manmade, tl1ey all depend on culture. But still, in every age and e1-{$\\cdot$}ery place tilt' structure of our 'l.Vorld is gi{$\\cdot$}ven to it, essentially, by some collection of patterns which keeps on repeating over ancl over atul o{\\textasciitilde}uer again. These patterm are not concrete elements, like bri(ks and doors-they are ;nuch deeper and more fluid-and yet they are the solid substance, underneat/; tl1e surface, out of wl1ich a building or a town is alu{$\\cdot$}ays made.'' (Alexander, 1979, p. 116)},\n  file = {E:\\Zotero\\storage\\X8CK2B72\\TWB_Christopher Alexander - The Timeless Way of Building-Oxford University Press (1979).pdf}\n}\n\n@book{alUmaLinguagemPadroes2012,\n  title = {{Uma linguagem de padr{\\~o}es: a pattern language}},\n  shorttitle = {{Uma linguagem de padr{\\~o}es}},\n  author = {et {al}, Christopher Alexander},\n  year = {2012},\n  month = jun,\n  publisher = {{Bookman}},\n  isbn = {978-85-65837-17-0},\n  langid = {brazilian},\n  keywords = {Arquitetura}\n}\n\n@book{alUmaLinguagemPadroes2012a,\n  title = {{Uma linguagem de padr{\\~o}es: a pattern language}},\n  shorttitle = {{Uma linguagem de padr{\\~o}es}},\n  author = {et {al}, Christopher Alexander},\n  year = {2012},\n  month = jun,\n  publisher = {{Bookman}},\n  isbn = {978-85-65837-17-0},\n  langid = {brazilian},\n  keywords = {Arquitetura},\n  file = {E:\\Zotero\\storage\\AYRGYUUR\\A Pattern Language_ Towns, Buildings, Construction (Cess  Center for Environmental) -- Christopher Alexander, Sara Ishikawa, Murray Silverstein -- 1977 -- Oxford University Press -- 9780195019193 -- 6a09e611.pdf}\n}\n\n@book{amaralOsPensandores2001,\n  title = {{Os Pensandores}},\n  author = {Amaral, Anna Lia},\n  year = {2001},\n  month = oct,\n  publisher = {{Romances Nova Cultural}},\n  collaborator = {Silva, Carlos Do Nascimento and Autores, Varios},\n  isbn = {978-85-351-1871-1},\n  langid = {brazilian},\n  keywords = {Literatura inglesa (inclui literatura do Canad{\\'a})}\n}\n\n@article{andersonComplicatingHeideggerTruth2011,\n  title = {Complicating {{Heidegger}} and the {{Truth}} of {{Architecture}}},\n  author = {ANDERSON, TRAVIS T.},\n  year = {2011},\n  journal = {The Journal of Aesthetics and Art Criticism},\n  volume = {69},\n  number = {1,},\n  eprint = {42635838},\n  eprinttype = {jstor},\n  pages = {69--79},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\X44BXFHD\\ANDERSON - 2011 - Complicating Heidegger and the Truth of Architectu.pdf}\n}\n\n@article{andradeCOGNICAOPARTICIPACAO,\n  title = {{COGNI{\\c C}{\\~A}O E PARTICIPA{\\c C}{\\~A}O 1}},\n  author = {Andrade, Leandro},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\Q7G48T86\\Andrade - COGNIÇÃO E PARTICIPAÇÃO 1.pdf}\n}\n\n@misc{ArchitectGardenerGeorge,\n  title = {The {{Architect}} and the {{Gardener}}: {{George R}}. {{R}}. {{Martin}} on {{Writing Game}} of {{Thrones}} - {{YouTube}}},\n  urldate = {2023-11-25},\n  howpublished = {https://www.youtube.com/watch?v=EBOafgYJABA},\n  file = {E:\\Zotero\\storage\\BEY566AV\\watch.html}\n}\n\n@misc{ArchivesEarlyDraft,\n  title = {Archives: {{An Early Draft}} of {{The Timeless Way}} of {{Building}}, 1970},\n  urldate = {2023-09-25},\n  howpublished = {https://www.patternlanguage.com/archive/timeless.html},\n  keywords = {TimelessWay},\n  note = {``Tudo isto requer uma mudan{\\c c}a fundamental de atitude. Se voc{\\^e} quiser fazer uma flor viva, voc{\\^e} n{\\~a}o {\\`a} constroi fisicamente com uma pin{\\c c}a, c{\\'e}lula por c{\\'e}lula; voc{\\^e} cultiva a partir da semente. Se voc{\\^e} quiser uma nova flor inteiramente nova, voc{\\^e} fabrica a semente e a permite crescer. As sementes do ambiente s{\\~a}o linguagens de padr{\\~o}es. A {\\'u}nica maneira s{\\'e}ria de influenciar o ambiente {\\'e} atrav{\\'e}s das linguagens de padr{\\~o}es a partir das quais ele cresce. Se voc{\\^e} quiser melhorar sua pr{\\'o}pria habilidade de design, melhore sua linguagem de padr{\\~o}es. Se voc{\\^e} quiser influenciar o ambiente mais amplo, plante suas ideias nas linguagens de padr{\\~o}es que outras pessoas usam. No final, a {\\'u}nica maneira pela qual podemos esperar criar um ambiente completo {\\'e} dar as m{\\~a}os e, juntos, criar uma linguagem padr{\\~a}o que ser{\\'a} a semente do nosso mundo.''},\n  file = {E:\\Zotero\\storage\\687DQRCZ\\timeless.html}\n}\n\n@article{arrudaLINGUAGEMDOSPADROES,\n  title = {{A LINGUAGEM DOS PADR{\\~O}ES E O PROJETO DE UM CONJUNTO}},\n  author = {Arruda, Clarice Coelho Marli{\\`e}re},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\UTJMUIY3\\Arruda - A LINGUAGEM DOS PADRÕES E O PROJETO DE UM CONJUNTO.pdf}\n}\n\n@misc{AvoidingAdjectiveFallacy,\n  title = {Avoiding {{The Adjective Fallacy}} {\\textendash} {{BetterExplained}}},\n  urldate = {2023-09-27},\n  howpublished = {https://betterexplained.com/articles/adjective-fallacy/},\n  file = {E:\\Zotero\\storage\\Y2AFBVWP\\adjective-fallacy.html}\n}\n\n@article{baileyKrashenRevisitedCase2021,\n  title = {Krashen {{Revisited}}: {{Case Study}} of the {{Role}} of {{Input}}, {{Motivation}} and {{Identity}} in {{Second Language Learning}}},\n  shorttitle = {Krashen {{Revisited}}},\n  author = {Bailey, Francis and Kadhum Fahad, Ahmed},\n  year = {2021},\n  month = jun,\n  journal = {Arab World English Journal},\n  volume = {12},\n  number = {2},\n  pages = {540--550},\n  issn = {22299327},\n  doi = {10.24093/awej/vol12no2.36},\n  urldate = {2023-12-06},\n  abstract = {Stephen Krashen has a long and enduring legacy in the field of second language acquisition. His ``Input Hypothesis'' was among the very first attempts to create a coherent theoretical account of second language learning. Krashen argued that learners can acquire language through the process of comprehending it. While elements of his model have been extensively critiqued, this idea has endured and offers teachers a clear mandate to provide learners with abundant opportunities to making meaning of the target language. Utilizing a case study of an English language learner, Krashen's model is challenged and enriched by considering the role that motivation and identity play in learning. Teachers tapping into an important source of learner motivation, role models drawn from the local community or broader society, can inspire and energize students' studies and help them visualize a life in which a second language plays a vital role. Building upon Krashen's idea of the importance of language teachers and programs creating robust reading programs for a sustained engagement with second language print resources, the authors propose to expand his vision and include all manner of multimedia and technologies. However, such a program can only succeed if teachers mediate their learners' social identities and motivations for sustained second language learning.},\n  langid = {english},\n  note = {``Krashen has claimed that learners do not develop grammatical competence by speaking and writing.'' (Bailey e Kadhum Fahad, 2021, p. 543)},\n  file = {E:\\Zotero\\storage\\DNV8H89A\\Bailey e Kadhum Fahad - 2021 - Krashen Revisited Case Study of the Role of Input.pdf}\n}\n\n@article{barrosRacionalidadeProblemasSelvagens2016,\n  title = {{Racionalidade e problemas selvagens no projeto de cidades inteligentes}},\n  author = {Barros, Gil},\n  year = {2016},\n  publisher = {{[object Object]}},\n  doi = {10.13140/RG.2.1.5003.6887},\n  urldate = {2024-03-21},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\TMB2MYLT\\Barros - 2016 - Racionalidade e problemas selvagens no projeto de .pdf}\n}\n\n@article{barrosUmaAbordagemInspiracao2010,\n  title = {{Uma abordagem de inspira{\\c c}{\\~a}o humanizadora para o projeto de habita{\\c c}{\\~a}o coletiva mais sustent{\\'a}vel}},\n  author = {Barros, Raquel Regina Martini Paula and Pina, S{\\'i}lvia Aparecida Mikami Gon{\\c c}alves},\n  year = {2010},\n  month = sep,\n  journal = {Ambiente Constru{\\'i}do},\n  volume = {10},\n  number = {3},\n  pages = {121--135},\n  issn = {1678-8621},\n  doi = {10.1590/S1678-86212010000300008},\n  urldate = {2023-08-28},\n  abstract = {This study presents a design approach that relates humanizing concepts to the environmental quality of multifamily housing. The conception of a more humane and sustainable dwelling suggests interdisciplinary theoretical engagement as a contribution to the design process. Selected patterns among those identified by Christopher Alexander and colleagues in 1977 were interpreted as design parameters that can be comprised by humanizing concepts, whose relevance was verified through the analysis of a comprehensive set of award-winning designs. These concepts require effective compatibility among the different possibilities suggested by the design parameters, and are equally fundamental for design quality as a whole. The synthetic and open character of the approach, combined with programming and site specificities allow for and recommend further contributions towards the consolidation of a humanizing knowledge base for the design process that fosters the improvement of more sustainable multifamily housing solutions.},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\4NQUDJZS\\Barros e Pina - 2010 - Uma abordagem de inspiração humanizadora para o pr.pdf}\n}\n\n@incollection{bauerPatternLanguageSpace2016,\n  title = {9. {{Pattern}} Language and Space Syntax: {{Alexander}}, {{Chomsky}}, {{Peirce}} and {{Wittgenstein}}},\n  shorttitle = {9. {{Pattern}} Language and Space Syntax},\n  booktitle = {Thinking with {{Diagrams}}},\n  author = {Bauer, Matthias},\n  editor = {Kr{\\\"a}mer, Sybille and Ljungberg, Christina},\n  year = {2016},\n  month = jul,\n  pages = {209--224},\n  publisher = {{De Gruyter}},\n  doi = {10.1515/9781501503757-010},\n  urldate = {2023-09-09},\n  isbn = {978-1-5015-0375-7},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\Q5P5SNL8\\Bauer - 2016 - 9. Pattern language and space syntax Alexander, C.pdf}\n}\n\n@misc{BavraStory2016,\n  title = {The {{Bavra Story}}},\n  year = {2016},\n  month = nov,\n  journal = {Building Beauty},\n  urldate = {2024-05-03},\n  abstract = {In 1961, at the age of 24, I lived in a village in Gujarat, India, for seven months. While I was living there, I felt I must be useful and after discussing with the villagers, we decided that a school would help them most{\\ldots}},\n  howpublished = {https://www.buildingbeauty.org/resource-center-entries/2016/11/02/bavra-story},\n  langid = {american},\n  file = {E:\\Zotero\\storage\\3AYYDF9Q\\bavra-story.html}\n}\n\n@article{beckerHumboldtCentralidadeDos2020,\n  title = {{W. von Humboldt e a centralidade dos conceitos de ``criatividade'' e ``forma'' para a ci{\\^e}ncia lingu{\\'i}stica do s{\\'e}culo XX}},\n  author = {Becker, Martin and Martins, Marco Antonio Rocha},\n  year = {2020},\n  journal = {Todas as Letras Revista de L{\\'i}ngua e Literatura},\n  volume = {22},\n  number = {3},\n  issn = {1980-6914},\n  doi = {10.5935/1980-6914/eLETLL2012899},\n  urldate = {2023-11-25},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\LCKASHWJ\\Becker e Martins - 2020 - W. von Humboldt e a centralidade dos conceitos de .pdf}\n}\n\n@article{benjaminRuaMaoUnica,\n  title = {{Rua de m{\\~a}o {\\'u}nica / Inf{\\^a}ncia berlinense: 1900}},\n  author = {Benjamin, Walter},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\DZBWGK47\\Benjamin - Rua de mão única  Infância berlinense 1900.pdf}\n}\n\n@article{bolkegTEACHINGPROGRAMMINGIMMERSION2002,\n  title = {{{TEACHING PROGRAMMING BY IMMERSION}}, {{READING AND WRTTING}}},\n  author = {Bolkeg, Ethan},\n  year = {2002},\n  abstract = {In the introductoryprogramming course at UMass Boston we teach JovaTMbyimmersion. Instead of starting with the traditional \"Hello, world\", students read, modgy and write about a 200 line bank ATMsimuIation program consisting of two cooperating classes.By the end of the semester they are working with a 3,500-line application that models a command line shell and a hierarchicalfile system. Our students learn programming the same way one best learns a spoken language: by immersion. Wefocus immediately on questions of interfaces. architecture and design. We spend little time on syntactic details. which students simply absorb as they need them. So in thisjirst course, students get taste of and an appreciationfor what realprogramming is all about.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\CAHQT45J\\Bolkeg - 2002 - TEACHING PROGRAMMING BY IMMERSION, READING AND WRT.pdf}\n}\n\n@book{brandHowBuildingsLearn1995,\n  title = {How Buildings Learn: What Happens after They're Built},\n  shorttitle = {How Buildings Learn},\n  author = {Brand, Stewart},\n  year = {1995},\n  publisher = {{Penguin Books}},\n  address = {{New York, NY}},\n  abstract = {\"Buildings have often been studied whole in space, but never before have they been studied whole in time.\" \"Architects (and architectural historians) are interested only in a building's original intentions. Most are dismayed by what happens later, when a building develops its own life, responsive to the life within. To get the rest of the story - to explore the years between the dazzle of a new building and its eventual corpse - Stewart Brand went to facilities managers and real estate professionals, to preservationists and building historians, to photo archives and to futurists. He inquired, \"What makes some buildings come to be loved?\" He found that all buildings are forced to adapt, but only some adapt gracefully.\" \"How Buildings Learn is a masterful new synthesis which proposes that buildings adapt best when constantly refined and reshaped by their occupants, and that architects can mature from being artists of space to becoming artists of time. A rich resource and point of departure, as stimulating for the general reader and home improvement hobbyist as for the building professional, the book is sure to generate ideas, provoke debate, and shake up habitual thinking.\" \"From the connected farmhouses of New England to I.M. Pei's Media Lab, from \"satisficing\" to \"form follows funding,\" from the evolution of bungalows to the invention of Santa Fe Style, from Low Road military surplus buildings to a High Road English classic like Chatsworth - this is a far-ranging survey of unexplored essential territory.\" \"More than any other human artifact, buildings improve with time - if they're allowed. How Buildings Learn shows how to work with time rather than against it.\"--Jacket},\n  isbn = {978-1-101-56264-2},\n  langid = {english},\n  annotation = {OCLC: 860833630},\n  note = {``ADAPTIVE USE. Robert Campbell wrote about these interior photos: ``Recyclings embody a paradox. They work best when the new use doesn't fit the old container too neatly. The slight misfit between old and new{\\textemdash}the incongruity of eating your dinner in a brokerage hall{\\textemdash}gives such places their special edge and drama.... The best buildings are not those that are cut, like a tailored suit, to fit only one set of functions, but rather those that are strong enough to retain their character as they accommodate different functions over time.'''' (Brand, 1995, p. 221)\n\\par\n``but responsibility is dispersed and delayed in a maze of anxious responsibility-avoidance, and the building sits heavy and inert.'' (Brand, 1995, p. 104)\n\\par\n``Only operations that are well-established, high-turnover, standardized or highly subsidized can afford, commonly, to carry the costs of new construction. Chain stores, chain restaurants and banks go into new construction. But neighborhood bars, foreign restaurants and pawn shops go into older buildings. Supermarkets and shoe stores often go into new buildings; good bookstores and antique dealers seldom do. Well-subsidized opera and art museums often go into new buildings. But the unformalized feeders of the arts{\\textemdash}studios, galleries, stores for musical instruments and art supplies, backrooms where the low earning power of a seat and table can absorb uneconomic discussions{\\textemdash}these go into old buildings...'' (Brand, 1995, p. 71)\n\\par\nJACOBS},\n  file = {E:\\Zotero\\storage\\PVVDG6VP\\Brand - 1995 - How buildings learn what happens after they're bu.pdf}\n}\n\n@misc{Brook2uwh7,\n  title = {Brook2uwh7},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/library/writing-generative-code.htm},\n  file = {E:\\Zotero\\storage\\GWSZAVLP\\writing-generative-code.html}\n}\n\n@misc{BuildingLivingNeighborhoods,\n  title = {Building {{Living Neighborhoods}} --{{What}} Is an {{Unfolding}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/whatisanunfolding.htm},\n  file = {E:\\Zotero\\storage\\6VHHEIC2\\whatisanunfolding.html}\n}\n\n@misc{BuildingLivingNeighborhoodsa,\n  title = {Building {{Living Neighborhoods}} --{{What}} Is an {{Unfolding}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/whatisanunfolding.htm},\n  file = {E:\\Zotero\\storage\\4XU7ZN8R\\whatisanunfolding.html}\n}\n\n@misc{BuildingLivingNeighborhoodsb,\n  title = {Building {{Living Neighborhoods}} -- {{Library}} of {{Unfoldings}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/libraryofunfoldings.htm},\n  file = {E:\\Zotero\\storage\\KJT4IWP4\\libraryofunfoldings.html}\n}\n\n@misc{BuildingLivingNeighborhoodsc,\n  title = {Building {{Living Neighborhoods}} -- {{Introduction}} -- {{Pattern Languages}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/patternlanguages.htm},\n  file = {E:\\Zotero\\storage\\APS6KVID\\patternlanguages.html}\n}\n\n@misc{careyArchitecture3DLanguage1977,\n  title = {Architecture as a {{3D Language}}},\n  author = {Carey, John Homer},\n  year = {1977}\n}\n\n@misc{ChatGPT,\n  title = {{ChatGPT}},\n  urldate = {2024-07-28},\n  abstract = {A conversational AI system that listens, learns, and challenges},\n  howpublished = {https://chatgpt.com/},\n  langid = {brazilian},\n  file = {E:\\Zotero\\storage\\CKJF3YMB\\chatgpt.com.html}\n}\n\n@misc{ChomskyAlexander,\n  title = {Chomsky \\& {{Alexander}}},\n  urldate = {2023-09-09},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\G8DL3HTJ\\chomskyalexander.blogspot.com.html}\n}\n\n@article{chomskyGalileanChallenge2017,\n  title = {The {{Galilean Challenge}}},\n  author = {Chomsky, Noam},\n  year = {2017},\n  month = apr,\n  journal = {Inference},\n  volume = {3},\n  number = {1},\n  urldate = {2023-12-08},\n  abstract = {Noam Chomsky argues that the internal faculty of language that allows linguistic computation and the language of thought is not dependent on the externalization of language, which is mediated by our sensorimotor systems. Communication is not the ultimate purpose of human language processing.},\n  chapter = {Linguistics},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\ZXXFVHAW\\Chomsky - 2017 - The Galilean Challenge.pdf}\n}\n\n@article{chomskyGalileanChallenge2017a,\n  title = {The {{Galilean Challenge}}},\n  author = {Chomsky, Noam},\n  year = {2017},\n  month = apr,\n  journal = {Inference},\n  volume = {3},\n  number = {1},\n  urldate = {2023-12-13},\n  abstract = {Noam Chomsky argues that the internal faculty of language that allows linguistic computation and the language of thought is not dependent on the externalization of language, which is mediated by our sensorimotor systems. Communication is not the ultimate purpose of human language processing.},\n  chapter = {Linguistics},\n  langid = {english}\n}\n\n@article{CollectedWorksPaul,\n  title = {The Collected Works of {{Paul Val{\\'e}ry}}},\n  langid = {english},\n  note = {``Nothing we know of our own actions enables us to imagine what it may be that so gracefully modulates these surfaces, element by element, row by row, without other tools than those contained in the thing that is being fashioned; what it may be that so miraculously harmonizes and adjusts the curves, and finishes the work with a boldness, an ease, a precision which the most graceful creations of the potter or bronze founder are far from equaling. Our artists do not derive the material of their works from their own substance, and the form for which they strive springs from a specialized application of their mind, which can be completely disengaged from their being. Perhaps what we call perfection in art (which all do not strive for and some disdain) is only a sense of desiring or finding in a human work the sureness of execution, the inner necessity, the indissoluble bond between form and material that are revealed to us by the humblest of shells.'' (``The collected works of Paul Val{\\'e}ry'', p. 27)},\n  file = {E:\\Zotero\\storage\\B6ZS7C3K\\The collected works of Paul Valéry.pdf}\n}\n\n@misc{ComplexityRisingHuman,\n  title = {Complexity {{Rising}}: {{From Human Beings}} to {{Human Civilization}}, a {{Complexity Profile}}},\n  shorttitle = {Complexity {{Rising}}},\n  journal = {New England Complex Systems Institute},\n  urldate = {2023-11-24},\n  abstract = {Since time immemorial humans have complained that life is becoming more complex, but it is only now that we have a hope to analyze formally and verify this lament.},\n  howpublished = {https://necsi.edu/complexity-rising-from-human-beings-to-human-civilization-a-complexity-profile},\n  langid = {american},\n  file = {E:\\Zotero\\storage\\QUN5MKVW\\complexity-rising-from-human-beings-to-human-civilization-a-complexity-profile.html}\n}\n\n@misc{ContrastingConceptsHarmony,\n  title = {Contrasting {{Concepts}} of {{Harmony}} in {{Architecture}}},\n  urldate = {2023-08-28},\n  howpublished = {http://www.katarxis3.com/Alexander\\_Eisenman\\_Debate.htm},\n  file = {E:\\Zotero\\storage\\9MZANDM8\\Alexander_Eisenman_Debate.html}\n}\n\n@incollection{cowieInnatenessLanguage2017,\n  title = {Innateness and {{Language}}},\n  booktitle = {The {{Stanford Encyclopedia}} of {{Philosophy}}},\n  author = {Cowie, Fiona},\n  editor = {Zalta, Edward N.},\n  year = {2017},\n  edition = {Fall 2017},\n  publisher = {{Metaphysics Research Lab, Stanford University}},\n  urldate = {2023-12-13},\n  abstract = {The philosophical debate over innate ideas and their role in the acquisition of knowledge has a venerable history. It is thus surprising that very little attention was paid until early last century to the questions of how linguistic knowledge is acquired and what role, if any, innate ideas might play in that process.},\n  keywords = {behaviorism,idiolects,innateness: and contemporary theories of cognition,{learning theory, formal},rationalism vs. empiricism},\n  file = {E:\\Zotero\\storage\\9K68UUSN\\innateness-language.html}\n}\n\n@book{davisEarlyUnpublishedWritings2022,\n  title = {Early and {{Unpublished Writings}} of {{Christopher Alexander}}: {{Thinking}}, {{Building}}, {{Writing}}},\n  shorttitle = {Early and {{Unpublished Writings}} of {{Christopher Alexander}}},\n  author = {Davis, Howard},\n  year = {2022},\n  month = jun,\n  edition = {1},\n  publisher = {{Routledge}},\n  address = {{London}},\n  doi = {10.4324/9781003187516},\n  urldate = {2023-09-25},\n  isbn = {978-1-00-318751-6},\n  langid = {english},\n  note = {``There is no way to cut this cycle of cause and effect, except at the root. It cannot be cut by making more houses which are commodities; nor by making better houses which are commodities; nor by making cheaper houses which are commodities. It can only be cut when we stop treating houses as commodities altogether, by our refusal, our total refusal, to treat houses as commodities {\\textendash} and by our consequent refusal to accept the monetary side conditions which come with the house, when it is seen as a commodity. To solve the housing problem, we must learn to look at a house as an activity. In this case, the life history of the house, and its relation to the people who live in it, and pass through it, is entirely different. The house is not produced at one time, and then used, unchanged, for years; it is created gradually, as a direct result of the living which is happening in it and around it. Building takes place in increments, day by day, year by year. The people who live in the house do not borrow money, ever; they spend only what they can afford. The people who live in the house are the ones who design it, as they go. They don't necessarily build it with their own hands; but they may build parts of it with their own hands, to help the builders. Each house is unique; it is the unique expression of a particular way of life, and of the particular history of all th'' (Davis, 2022, p. 229)},\n  file = {E:\\Zotero\\storage\\SLBSQ3SA\\Davis - 2022 - Early and Unpublished Writings of Christopher Alex.pdf}\n}\n\n@article{dawesChristopherAlexanderPattern2017,\n  title = {Christopher {{Alexander}}'s {{A Pattern Language}}: Analysing, Mapping and Classifying the Critical Response},\n  shorttitle = {Christopher {{Alexander}}'s {{A Pattern Language}}},\n  author = {Dawes, Michael J. and Ostwald, Michael J.},\n  year = {2017},\n  month = dec,\n  journal = {City, Territory and Architecture},\n  volume = {4},\n  number = {1},\n  pages = {17},\n  issn = {2195-2701},\n  doi = {10.1186/s40410-017-0073-1},\n  urldate = {2023-09-07},\n  abstract = {A Pattern Language by Christopher Alexander is renowned for providing simple, conveniently formatted, humanist solutions to complex design problems ranging in scale from urban planning through to interior design. This text is also believed to be the most widely read architectural treatise ever published. Despite this, there is also little acknowledgement in its popular reception that it is only one part of a trilogy of works documenting Alexander's `second theory' of architecture. Thus, while A Pattern Language is widely referenced in architectural scholarship, most of these references simply acknowledge its existence and fail to engage with its content. Furthermore, the literature that does critically engage with Alexander's theory, challenging its ideas and assumptions, is often difficult to find, and the criticisms are diverse and complex. The intent of this paper is to facilitate a deeper understanding of these criticisms and the relationships between them. The 28 criticisms identified in past research are organised hierarchically in this paper into three tiers representing those associated with the: (i) conceptualisation, (ii) development and documentation and, (iii) implementation and outcomes of Alexander's theory. The relationships between these criticisms are then mapped diagrammatically thereby forming the basis for thematic groupings within each hierarchical tier. This organisation reveals that only two criticisms relate to the concept of pattern languages in isolation, while the remainder arise, directly or indirectly, from Alexander's idiosyncratic ontological and epistemological positions. The conclusion analyses the relationships between the criticisms to develop a holistic and understanding of where the problems in Alexander's theory might lie.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\28F7XF3G\\Dawes e Ostwald - 2017 - Christopher Alexander’s A Pattern Language analys.pdf}\n}\n\n@article{dawesMathematicalStructureAlexander2020,\n  title = {The Mathematical Structure of {{Alexander}}'s {{{\\emph{A Pattern Language}}}} : {{An}} Analysis of the Role of Invariant Patterns},\n  shorttitle = {The Mathematical Structure of {{Alexander}}'s {{{\\emph{A Pattern Language}}}}},\n  author = {Dawes, Michael J and Ostwald, Michael J},\n  year = {2020},\n  month = jan,\n  journal = {Environment and Planning B: Urban Analytics and City Science},\n  volume = {47},\n  number = {1},\n  pages = {7--24},\n  issn = {2399-8083, 2399-8091},\n  doi = {10.1177/2399808318761396},\n  urldate = {2023-10-02},\n  abstract = {In 1977 Christopher Alexander and his colleagues from the Centre for Environmental Structure published A Pattern Language, an innovative design guide aimed at restoring life and beauty to the built environment. Since then, A Pattern Language has become one of the most widely read architectural treatises ever published. However, despite its popularity, the structure of A Pattern Language remains poorly understood. In response to this situation, this paper uses graph theory to examine Alexander's language including the entire set of 253 patterns and over 1800 relationships between them. Through this mathematical analysis the paper tests two hypotheses about the `invariant patterns' Alexander was most confident in. The first hypothesis tests whether invariant patterns occupy more prominent positions within the language, and the second tests whether invariant patterns form a core structure within the language that supports less developed patterns. Through this process the paper illuminates several previously unconsidered aspects of the structure of A Pattern Language while providing the first graphic representation of the entire underlying structure that unites the individual patterns into a coherent language.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\ANSQSLN7\\Dawes e Ostwald - 2020 - The mathematical structure of Alexander’s A Pat.pdf}\n}\n\n@article{dimmickPrimeirasEstorias1964,\n  title = {{Primeiras Est{\\'o}rias}},\n  author = {Dimmick, R. E. and Rosa, Jo{\\~a}o Guimar{\\~a}es},\n  year = {1964},\n  journal = {Books Abroad},\n  volume = {38},\n  number = {1},\n  eprint = {10.2307/40118575},\n  eprinttype = {jstor},\n  pages = {103},\n  issn = {00067431},\n  doi = {10.2307/40118575},\n  urldate = {2023-11-01},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\FSRPLGC3\\Dimmick e Rosa - 1964 - Primeiras Estórias.pdf}\n}\n\n@article{doveyPatternLanguageIts1990,\n  title = {The Pattern Language and Its Ene Es},\n  author = {Dovey, Kimberly},\n  year = {1990},\n  journal = {DESIGN STUDIES},\n  volume = {11},\n  number = {1},\n  abstract = {The work of Christopher Alexander and his associates on the pattern language approach to environmental design is considered from the point of view of the varie{\\textcent}y of forces which oppose its implementation. It is argued that as a radical paradigm shift in environmental design, the pattern language faces opposition from epistemological, political, ideological and aesthetic 'enemies'. These oppositions are fundamental to the nature of the paradigm shift proposed, and they reveal some of the dilemmas in the theory and practice of environmental design.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\VG5LAYMW\\Dovey - 1990 - The pattern language and its ene es.pdf}\n}\n\n@book{dreyfusRetrievingRealism2015,\n  title = {Retrieving Realism},\n  author = {Dreyfus, Hubert L. and Taylor, Charles},\n  year = {2015},\n  publisher = {{Harvard University Press}},\n  address = {{Cambridge, MA}},\n  isbn = {978-0-674-96751-9},\n  langid = {english},\n  lccn = {BD161 .D74 2015},\n  keywords = {{Knowledge, Theory of},Realism},\n  file = {E:\\Zotero\\storage\\UALYMWE5\\Dreyfus e Taylor - 2015 - Retrieving realism.pdf}\n}\n\n@misc{EnvironmentalStructureIntroduction,\n  title = {Environmental {{Structure}} -- {{Introduction}} -- {{Morphogenesis}}},\n  urldate = {2024-04-09},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/morphogenesis-two.htm\\#rules},\n  file = {E:\\Zotero\\storage\\WCRT4KTA\\morphogenesis-two.html}\n}\n\n@misc{EnvironmentalStructureIntroductiona,\n  title = {Environmental {{Structure}} -- {{Introduction}} -- {{Morphogenesis}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/morphogenesis-two.htm\\#rules},\n  file = {E:\\Zotero\\storage\\AN8TKAPE\\morphogenesis-two.html}\n}\n\n@misc{EnvironmentalStructureMorphogenesis,\n  title = {Environmental {{Structure}} -- {{Morphogenesis}} -- {{The Order Things}} Are {{Done}}},\n  urldate = {2024-04-11},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/order-things-done.htm},\n  file = {E:\\Zotero\\storage\\PWM5ASAE\\order-things-done.html}\n}\n\n@article{ericksonLinguaFrancasDesign,\n  title = {Lingua {{Francas}} for {{Design}}: {{Sacred Places}} and {{Pattern Languages}}},\n  author = {Erickson, Thomas},\n  abstract = {A central challenge in interaction design has to do with its diversity. Designers, engineers, managers, marketers, researchers and users all have important contributions to make to the design process. But at the same time they lack shared concepts, experiences and perspectives. How is the process of design{\\textemdash}which requires communication, negotiation and compromise{\\textemdash}to effectively proceed in the absence of a common ground? I argue that an important role for the interaction designer is to help stakeholders in the design process to construct a lingua franca. To explore this issue, which has received remarkably little attention in HCI, I turn to work in urban design and architecture. I begin by discussing a case study in community design, reported by Hester [10], that demonstrates the power of a lingua franca for a particular design project. I then describe the concept of pattern languages and discuss how they might be adapted to the needs of interaction design in general, and used, in particular, as metalanguages for generating lingua francas for particular design projects.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\BUYKI36I\\Erickson - Lingua Francas for Design Sacred Places and Patte.pdf}\n}\n\n@misc{FifteenProperties,\n  title = {Fifteen {{Properties}}},\n  urldate = {2024-04-11},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/fifteen.htm},\n  file = {E:\\Zotero\\storage\\IFWXFKVB\\fifteen.html}\n}\n\n@book{freemanHeadFirstDesign2004,\n  title = {Head {{First}} Design Patterns},\n  editor = {Freeman, Eric and Robson, Elisabeth and Sierra, Kathy and Bates, Bert},\n  year = {2004},\n  publisher = {{O'Reilly}},\n  address = {{Sebastopol, CA}},\n  isbn = {978-0-596-00712-6},\n  langid = {english},\n  lccn = {QA76.76.D47 H427 2004},\n  keywords = {Computer software,Development,Java (Computer program language)},\n  annotation = {OCLC: ocm56929619},\n  note = {A unica coisa constante no mundo {\\'e} o fato de que ele est{\\'a} em constante mudan{\\c c}a.\n\\par\nIsso {\\'e} verdade para nossas estruturas f{\\'i}sicas e tamb{\\'e}m para c{\\'o}digo.},\n  file = {E:\\Zotero\\storage\\JJNXUXGK\\Freeman et al. - 2004 - Head First design patterns.pdf}\n}\n\n@inproceedings{galanterArtificialIntelligenceProblems2019,\n  title = {Artificial {{Intelligence}} and {{Problems}} in {{Generative Art Theory}}},\n  booktitle = {Proceedings of {{EVA London}} 2019},\n  author = {Galanter, Philip},\n  year = {2019},\n  month = jul,\n  doi = {10.14236/ewic/EVA2019.22},\n  urldate = {2023-11-10},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\VT7BURK6\\Galanter - 2019 - Artificial Intelligence and Problems in Generative.pdf}\n}\n\n@article{galleChristopherAlexanderBattle2020,\n  title = {Christopher {{Alexander}}'s {{Battle}} for {{Beauty}} in a {{World Turning Ugly}}: {{The Inception}} of a {{Science}} of {{Architecture}}?},\n  shorttitle = {Christopher {{Alexander}}'s {{Battle}} for {{Beauty}} in a {{World Turning Ugly}}},\n  author = {Galle, Per},\n  year = 2020,\n  journal = {She Ji: The Journal of Design, Economics, and Innovation},\n  volume = {6},\n  number = {3},\n  pages = {345--375},\n  issn = {24058726},\n  doi = {10.1016/j.sheji.2020.03.002},\n  urldate = {2023-09-24},\n  abstract = {Christopher Alexander has been a leading pioneer of academic research on architectural and urban design since the early 1960s. He is also a practicing architect and builder with a passion for creating and restoring life and beauty to our physical environment. In this essay I review, evaluate, and reflect on some of his particularly fruitful, promising, or problematic ideas. I will put forth some ideas of my own for clarification, and to indicate avenues for future research. I argue that Alexander's notion of patterns (a verbal medium for capturing and conveying design knowledge in a systematic, reusable form) is in need of conceptual development along lines I suggest, even though Alexander downplayed the significance of patterns as he moved on to other theoretical ideas (mainly about aesthetics) later in his career. While I go into some detail about selected parts of Alexander's work, the intended readership of this essay is not restricted to specialists. I have made an effort to provide guidance and background information to readers not already familiar with Alexander's comprehensive body of theory.},\n  langid = {english},\n  note = {````In the most basic terms, Alexander's search for Beauty was confounded by the essential need for complexity in the built world. What Alexander admired is complex but organically so: ancient city plans, rustic buildings, stave churches, Japanese gardens, classical music, how people interact socially, and nature.... [In TNO,] Alexander was describing the edge of chaos {\\textemdash} a place balanced between order and chaos, or between simplicity and complexity. When we look too deeply into chaos, we find only disorder; when we look too deeply into order [which Alexander was accusing many contemporary architects and planners of doing], we find only the botfly of boredom; when we look in between, we find Beauty, poetry, life.'''' (Galle, 2020, p. 366)},\n  file = {E:\\Zotero\\storage\\SRUM47FW\\Galle - 2020 - Christopher Alexander’s Battle for Beauty in a Wor.pdf}\n}\n\n@book{gallSystemsBibleBeginner2018,\n  title = {The Systems Bible: The Beginner's Guide to Systems Large and Small: Being the Third Edition of {{Systemantics}}},\n  shorttitle = {The Systems Bible},\n  author = {Gall, John},\n  year = {2018},\n  publisher = {{General Systemantics Press}},\n  address = {{Walker, Minnesota}},\n  isbn = {978-0-9618251-7-1},\n  langid = {english},\n  note = {``BAD DESIGN CAN RARELY BE OVERCOME BY MORE DESIGN, WHETHER GOOD OR BAD'' (Gall, 2018, p. 166)\n\\par\n``A TEMPORARY PATCH WILL VERY LIKELY BE PERMANENT'' (Gall, 2018, p. 60)},\n  file = {E:\\Zotero\\storage\\JA9W4JG9\\Gall - 2018 - The systems bible the beginner's guide to systems.pdf}\n}\n\n@article{gareETHICSPHILOSOPHYENVIRONMENT,\n  title = {{{ETHICS}}, {{PHILOSOPHY AND THE ENVIRONMENT}}},\n  author = {Gare, Arran},\n  abstract = {Educated people everywhere now acknowledge that ecological destruction is threatening the future of civilization. While philosophers have concerned themselves with environmental problems, they appear to offer little to deal with this crisis. Despite this, I will argue that philosophy, and ethics, are absolutely crucial to overcoming this crisis. Philosophy has to recover its grand ambitions to achieve a comprehensive understanding of nature and the place of humanity within it, and ethics needs to be centrally concerned with the virtues required to create and then sustain economic, social and political formations that augment the life of ecological communities. Achieving these ends will involve reviving speculative philosophy and its quest to forge a synthesis of natural philosophy, history and art to enable humanity to redefine its place in the world, both collectively and as individuals, in very practical ways. Such a synthesis is required to oppose the corrosion of democracy and to revive the virtues of citizenship and the sense of responsibility citizenship entails, but more fundamentally and intimately related to such citizenship, to oppose managerialism and the proletarianization of the workforce and to revive workmanship and professionalism as the foundations of not only economic life, but social and political life.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\C8XLNT7A\\Gare - ETHICS, PHILOSOPHY AND THE ENVIRONMENT.pdf}\n}\n\n@article{GenerativeCodes,\n  title = {Generative {{Codes}}},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\VN3UNLR9\\Generative Codes.pdf}\n}\n\n@misc{GenerativeCodesa,\n  title = {Generative {{Codes}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/generative.htm},\n  file = {E:\\Zotero\\storage\\KSHHPIS9\\generative.html}\n}\n\n@article{GenerativeCodesb,\n  title = {Generative {{Codes}}},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\JWP4UMSP\\Generative Codes.pdf}\n}\n\n@misc{GenerativeCodeWelcome,\n  title = {Generative {{Code Welcome}}},\n  urldate = {2024-04-11},\n  howpublished = {https://www.livingneighborhoods.org/ht-0/gcwelcome.htm},\n  file = {E:\\Zotero\\storage\\WK7GZVXE\\gcwelcome.html}\n}\n\n@misc{GeometryLivingNeighborhoods2016,\n  title = {The {{Geometry}} of {{Living Neighborhoods}}},\n  year = {2016},\n  month = oct,\n  journal = {Building Beauty},\n  urldate = {2024-04-18},\n  abstract = {For the greater part, these things are all made by fitting {\\textendash} by gradual and careful adjustment {\\textendash} to the land, one room to another, a doorway to a beam, a vaulted ceiling to an odd-shaped room. In short they are generated forms{\\ldots}},\n  howpublished = {https://www.buildingbeauty.org/resource-center-entries/2016/10/26/the-geometry-of-living-neighborhoods},\n  langid = {american},\n  note = {For the greater part, these things are all made by fitting {\\textendash} by gradual and careful adjustment {\\textendash} to the land, one room to another, a doorway to a beam, a vaulted ceiling to an odd-shaped room. In short they are generated forms. They cannot be described adequately by equations or by drawing straight lines. Most of them are far too complex for that. The same is true, of course, for the objects created by nature {\\textendash} rock, cliffs, sand dunes, trees and tree trunks, human bodies, animal shapes, the shape of a cat's eye. It is the same with these things, as it is with things that human beings have built. So the language of these shapes must be a language of generative process, because it is only in the steps taken to achieve the shape, that we can record and capture the shapes and forms even to reproduce them.},\n  file = {E:\\Zotero\\storage\\RRR9P6F3\\the-geometry-of-living-neighborhoods.html}\n}\n\n@book{georgescu-roegenEntropyLawEconomic1971,\n  title = {The Entropy Law and the Economic Process},\n  author = {{Georgescu-Roegen}, Nicholas},\n  year = {1971},\n  publisher = {{Harvard University Press}},\n  address = {{Cambridge, Mass}},\n  isbn = {978-0-674-25780-1},\n  langid = {english},\n  lccn = {HB171 .G43},\n  keywords = {Economics,Entropy},\n  file = {E:\\Zotero\\storage\\B98MCXVT\\Georgescu-Roegen - 1971 - The entropy law and the economic process.pdf}\n}\n\n@book{gigerenzerGutFeelingsIntelligence2014,\n  title = {Gut Feelings: The Intelligence of the Unconscious},\n  shorttitle = {Gut Feelings},\n  author = {Gigerenzer, Gerd},\n  year = {2014},\n  publisher = {{Penguin Books}},\n  address = {{New York}},\n  abstract = {Why is split second decision-making superior to deliberation' Gut Feelings delivers the science behind Malcolm Gladwell's Blink Reflection and reason are overrated, according to renowned psychologist Gerd Gigerenzer. Much better qualified to help us make decisions is the cognitive, emotional, and social repertoire we call intuition'a suite of gut feelings that have evolved over the millennia specifically for making decisions. 'Gladwell drew heavily on Gigerenzer's research. But Gigerenzer goes a step further by explaining just why our gut instincts are so often right. Intuition, it seems, is not some sort of mystical chemical reaction but a neurologically based behavior that evolved to ensure that we humans respond quickly when faced with a dilemma' (BusinessWeek)},\n  isbn = {978-1-101-20241-8},\n  langid = {english},\n  annotation = {OCLC: 883325503},\n  note = {``he intelligence of the unconscious is in knowing, without thinking, which rule is likely to work in which situation.'' (Gigerenzer, 2014, p. 22)\n\\par\n``The man realizes that he has to do something about it- but he does not do so by remembering the general rule 4'' (Alexander, 1979, p. 49)\n\\par\n``and then applying it (\"When the snow starts to melt it is too hot inside the igloo and therefore time to ...\") . He simply does it.'' (Alexander, 1979, p. 50)},\n  file = {E:\\Zotero\\storage\\5KXMY74G\\Gigerenzer - 2014 - Gut feelings the intelligence of the unconscious.pdf}\n}\n\n@misc{GuidingPatternsNaturally,\n  title = {Guiding {{Patterns}} of {{Naturally Occurring Design}}: {{Mining Living Quality}} (Conf)},\n  urldate = {2023-09-12},\n  howpublished = {https://www.synapse9.com/pub/2015\\_PURPLSOC-JLHfinalpub.pdf},\n  file = {E:\\Zotero\\storage\\WIA5E6G8\\2015_PURPLSOC-JLHfinalpub.pdf}\n}\n\n@misc{gunziLeiGall2022,\n  title = {{A Lei de Gall}},\n  author = {Gunzi, Arnaldo},\n  year = {2022},\n  month = sep,\n  urldate = {2023-11-25},\n  abstract = {Sabe aquele sistema perfeito, pensado nos m{\\'i}nimos detalhes para resolver todos os problemas de alguma {\\'a}rea da empresa? Pois {\\'e}, ele nunca vai existir. Muito menos, se for constru{\\'i}do do zero. ``{\\ldots}},\n  langid = {brazilian},\n  file = {E:\\Zotero\\storage\\DRQGAETY\\a-lei-de-gall.html}\n}\n\n@misc{HabitacaoSocialNa2019,\n  title = {{Habita{\\c c}{\\~a}o social na Am{\\'e}rica Latina: desenho capaz de estabelecer 'pertencimento emocional'}},\n  shorttitle = {{Habita{\\c c}{\\~a}o social na Am{\\'e}rica Latina}},\n  year = {2019},\n  month = mar,\n  journal = {ArchDaily Brasil},\n  urldate = {2023-08-28},\n  abstract = {Habita{\\c c}{\\~a}o social na Am{\\'e}rica Latina: desenho capaz de estabelecer 'posse emocional'},\n  howpublished = {https://www.archdaily.com.br/br/913159/habitacao-social-na-america-latina-desenho-capaz-de-estabelecer-posse-emocional},\n  langid = {brazilian},\n  file = {E:\\Zotero\\storage\\QF7B3J7R\\habitacao-social-na-america-latina-desenho-capaz-de-estabelecer-posse-emocional.html}\n}\n\n@book{hackerWittgensteinPlaceTwentiethcentury1997,\n  title = {Wittgenstein's Place in Twentieth-Century Analytic Philosophy},\n  author = {Hacker, P. M. S.},\n  year = {1997},\n  publisher = {{Blackwell}},\n  address = {{Cambridge, Mass}},\n  isbn = {978-0-631-20098-7 978-0-631-20099-4},\n  langid = {english},\n  lccn = {B3376.W564 H245 1997},\n  keywords = {Analysis (Philosophy),{Wittgenstein, Ludwig}},\n  file = {E:\\Zotero\\storage\\W7SR2JG5\\Hacker - 1997 - Wittgenstein's place in twentieth-century analytic.pdf}\n}\n\n@article{HermanHertzberger2023,\n  title = {Herman {{Hertzberger}}},\n  year = {2023},\n  month = mar,\n  journal = {Wikipedia},\n  urldate = {2023-11-15},\n  abstract = {Herman Hertzberger (born 6 July 1932) is a Dutch architect, and a professor emeritus of the Delft University of Technology. In 2012 he received the Royal Gold Medal of the Royal Institute of British Architects.},\n  copyright = {Creative Commons Attribution-ShareAlike License},\n  langid = {english},\n  annotation = {Page Version ID: 1146761525},\n  file = {E:\\Zotero\\storage\\2EZDTB68\\Herman_Hertzberger.html}\n}\n\n@article{hernandezWordStoneHistory,\n  title = {Of {{Word}} and {{Stone}}: {{The History}} of {{Medieval Spain}} through the {{Lens}} of {{Architecture}} and {{Language}}},\n  author = {Hernandez, Samantha},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\8VAJEAAI\\Hernandez - Of Word and Stone The History of Medieval Spain t.pdf}\n}\n\n@article{hogarthEducatingIntuition,\n  title = {Educating Intuition},\n  author = {Hogarth, Robin M},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\RT7XRGHR\\Hogarth - Educating intuition.pdf}\n}\n\n@misc{InterviewPatternLanguage2010,\n  title = {An Interview with \"{{Pattern Language}}\" Author {{Christopher Alexander}}},\n  year = {2010},\n  month = dec,\n  journal = {resilience},\n  urldate = {2024-04-11},\n  abstract = {Christopher Alexander, architect, thinker, designer, author of the seminal `A Pattern Language' and of the more recent extraordinary `The Nature of Order' series of books, has long been someone whose work I have admired greatly. \"... I finally realised that every one of these cultures had essentially a system of rules {\\textendash} though `rules' is too strong a word because they were not binding. They weren't being forced down somebody's throat, but they were rules that everyone understood and which had to be used to get a good result.\"},\n  howpublished = {https://www.resilience.org/stories/2010-12-23/interview-pattern-language-author-christopher-alexander/},\n  langid = {american},\n  file = {E:\\Zotero\\storage\\CYK8K6WM\\interview-pattern-language-author-christopher-alexander.html}\n}\n\n@book{jacobsMorteVidaGrandes2022,\n  title = {{Morte E Vida De Grandes Cidades}},\n  author = {Jacobs, Jane},\n  year = {2022},\n  month = jun,\n  publisher = {{Editora WMF Martins Fontes}},\n  isbn = {978-85-7827-173-2},\n  langid = {brazilian},\n  file = {E:\\Zotero\\storage\\CQBJEDQH\\ARQ_Morte e vida das grandes cidades - Jane Jacobs.pdf}\n}\n\n@article{jiangChristopherAlexanderHis2019,\n  title = {Christopher {{Alexander}} and {{His Life}}'s {{Work}}: {{The Nature}} of {{Order}}},\n  shorttitle = {Christopher {{Alexander}} and {{His Life}}'s {{Work}}},\n  author = {Jiang, Bin},\n  year = {2019},\n  month = mar,\n  journal = {Urban Science},\n  volume = {3},\n  number = {1},\n  pages = {30},\n  issn = {2413-8851},\n  doi = {10.3390/urbansci3010030},\n  urldate = {2024-04-08},\n  abstract = {This editorial briefly introduces Christopher Alexander, as a theorist, as a design practitioner, as an architect, and importantly as a scientist, as well as his life's work{\\textemdash}The Nature of Order{\\textemdash}focusing not only on the trinity of wholeness, life, beauty, but also on his new organic cosmology.},\n  copyright = {https://creativecommons.org/licenses/by/4.0/},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\ZTBYVAIS\\Jiang - 2019 - Christopher Alexander and His Life’s Work The Nat.pdf}\n}\n\n@article{jiangRecursiveDefinitionGoodness2019,\n  title = {A {{Recursive Definition}} of {{Goodness}} of {{Space}} for {{Bridging}} the {{Concepts}} of {{Space}} and {{Place}} for {{Sustainability}}},\n  author = {Jiang, Bin},\n  year = {2019},\n  month = jul,\n  journal = {Sustainability},\n  volume = {11},\n  number = {15},\n  pages = {4091},\n  issn = {2071-1050},\n  doi = {10.3390/su11154091},\n  urldate = {2024-05-27},\n  abstract = {Conceived and developed by Christopher Alexander through his life's work, The Nature of Order, wholeness is defined as a mathematical structure of physical space in our surroundings. Yet, there was no mathematics, as Alexander admitted then, that was powerful enough to capture his notion of wholeness. Recently, a mathematical model of wholeness, together with its topological representation, has been developed that is capable of addressing not only why a space is good, but also how much goodness the space has. This paper develops a structural perspective on goodness of space (both large- and small-scale) in order to bridge two basic concepts of space and place through the very concept of wholeness. The wholeness provides a de facto recursive definition of goodness of space from a holistic and organic point of view. A space is good, genuinely and objectively, if its adjacent spaces are good, the larger space to which it belongs is good, and what is contained in the space is also good. Eventually, goodness of space, or sustainability of space, is considered a matter of fact rather than of opinion under the new view of space: space is neither lifeless nor neutral, but a living structure capable of being more living or less living, or more sustainable or less sustainable. Under the new view of space, geography or architecture will become part of complexity science, not only for understanding complexity, but also for making and remaking complex or living structures.},\n  copyright = {https://creativecommons.org/licenses/by/4.0/},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\MPGNQXC2\\Jiang - 2019 - A Recursive Definition of Goodness of Space for Br.pdf}\n}\n\n@misc{JoaoGuimaraesRosa,\n  title = {Jo{\\~a}o {{Guimar{\\~a}es Rosa}} - {{Entrevistado}} Por {{G{\\\"u}nter Lorenz}} '{{Di{\\'a}logo}} Com {{Guimar{\\~a}es Rosa}}'},\n  urldate = {2023-09-25},\n  abstract = {Jo{\\~a}o Guimar{\\~a}es Rosa - Entrevistado por G{\\\"u}nter Lorenz 'Di{\\'a}logo com Guimar{\\~a}es Rosa',},\n  file = {E:\\Zotero\\storage\\7HUZDIML\\dialogo-com-guimaraes-rosa-entrevista.html}\n}\n\n@misc{kaaronenRulesThumbCultural2021,\n  title = {Rules of Thumb and Cultural Evolution: {{How}} Simple Heuristics Have Guided Human Adaptation and the Emergence of Cultural Complexity},\n  shorttitle = {Rules of Thumb and Cultural Evolution},\n  author = {Kaaronen, Roope Oskari and Manninen, Mikael A. and Eronen, Jussi T.},\n  year = {2021},\n  month = aug,\n  doi = {10.31234/osf.io/sn923},\n  urldate = {2024-05-23},\n  abstract = {This article combines insights from ecological rationality and cultural evolution to illustrate how simple heuristics {\\textendash} colloquially, ``rules of thumb'' {\\textendash} have guided human behaviour and the evolution of complex cultures. Through a variety of examples and case studies, we discuss how human cultures have used rules of thumb in domains as diverse as foraging, resource management, social learning, moral judgment, and cultural niche construction. We propose four main arguments. Firstly, we argue that human societies have a rich cultural history in applying rules of thumb to guide daily activities and social organization. Second, we emphasise how rules of thumb may be convenient units of cultural transmission and high-fidelity social learning {\\textendash} the backbones of cumulative cultural evolution. Third, we highlight how rules of thumb can facilitate efficient decision making by making use of environmental and bodily features. Fourth, we discuss how simple rules of thumb may serve as building blocks for the emergence of more complex cultural patterns. This paper sets a research agenda for studying how simple rules contribute to cultural evolution in the past, the present, and the Anthropocene future.},\n  copyright = {https://creativecommons.org/licenses/by/4.0/legalcode},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\7EUT9V58\\Kaaronen et al. - 2021 - Rules of thumb and cultural evolution How simple .pdf}\n}\n\n@misc{kaaronenRulesThumbCultural2021a,\n  title = {Rules of Thumb and Cultural Evolution: {{How}} Simple Heuristics Have Guided Human Adaptation and the Emergence of Cultural Complexity},\n  shorttitle = {Rules of Thumb and Cultural Evolution},\n  author = {Kaaronen, Roope Oskari and Manninen, Mikael A. and Eronen, Jussi T.},\n  year = {2021},\n  month = aug,\n  doi = {10.31234/osf.io/sn923},\n  urldate = {2024-06-29},\n  abstract = {This article combines insights from ecological rationality and cultural evolution to illustrate how simple heuristics {\\textendash} colloquially, ``rules of thumb'' {\\textendash} have guided human behaviour and the evolution of complex cultures. Through a variety of examples and case studies, we discuss how human cultures have used rules of thumb in domains as diverse as foraging, resource management, social learning, moral judgment, and cultural niche construction. We propose four main arguments. Firstly, we argue that human societies have a rich cultural history in applying rules of thumb to guide daily activities and social organization. Second, we emphasise how rules of thumb may be convenient units of cultural transmission and high-fidelity social learning {\\textendash} the backbones of cumulative cultural evolution. Third, we highlight how rules of thumb can facilitate efficient decision making by making use of environmental and bodily features. Fourth, we discuss how simple rules of thumb may serve as building blocks for the emergence of more complex cultural patterns. This paper sets a research agenda for studying how simple rules contribute to cultural evolution in the past, the present, and the Anthropocene future.},\n  copyright = {https://creativecommons.org/licenses/by/4.0/legalcode},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\QYMQ6ZYB\\Kaaronen et al. - 2021 - Rules of thumb and cultural evolution How simple .pdf}\n}\n\n@article{kappArquitetoSempreTem2009,\n  title = {{Arquiteto sempre tem conceito, esse {\\'e} o problema}},\n  author = {Kapp, Silke and Nogueira, Priscilla and Baltazar, Ana Paula},\n  year = {2009},\n  abstract = {The title comes from an interview with a self-producer who wants help to conceive his home but not from an architect, because ``architects always have concepts {\\textendash} this is the problem''. His assertion unveils the distance between two practices: the conventional process of design of architects and the self-production that springs from what we call here ``popular'' demand. It is not difficult to understand that these were apart in the past, when architects were just a few and almost exclusively called for unusual, representative and extraordinary enterprises. Nowadays, with the spread of university education, the number of architects in relation to the Brazilian population has grown about ten times comparing with the golden age of modernism. However, architects are still of little use for the great majority of this population. This paper examines the characteristics and origins of such a gap, departing from a narrative of the meeting of both practices in question (actually, a synthesis of different situations found in field research investigating self-production of dwellings). From this narrative it analyses the ``popular'' demand, characterised not only by relatively scarce financial resources, but also by that which Bourdieu calls ``taste of necessity'' instead of aspirations for ``symbolic profit''. Summarising, they are demands for spatial configuration and technical solutions but not for ``works of architecture'' in analogy with ``works of art''. It then analyses the design practice based on the production of extraordinary spaces concerning, specially, its introspective reference to a fiction: the concept. The paper concludes indicating the need for a substantial change in procedure: towards an architecture that is responsive to popular demands, that cares mainly to open the process to participation of the directly involved, and that instead of concepts, focuses on spatial articulations, constructive solutions and its adequacy to the natural and urban context.},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\IADS8ANF\\Kapp et al. - Arquiteto sempre tem conceito, esse é o problema.pdf}\n}\n\n@book{karataniArchitectureMetaphorLanguage1995,\n  title = {Architecture as Metaphor: Language, Number, Money},\n  shorttitle = {Architecture as Metaphor},\n  author = {Karatani, K{\\=o}jin and Speaks, Michael},\n  year = {1995},\n  series = {Writing Architecture},\n  publisher = {{MIT Press}},\n  address = {{Cambridge, Mass}},\n  isbn = {978-0-262-61113-8},\n  langid = {english},\n  lccn = {AC146 .K321313 1995},\n  file = {E:\\Zotero\\storage\\8WTM53X2\\Karatani e Speaks - 1995 - Architecture as metaphor language, number, money.pdf}\n}\n\n@article{kohnPunishedRewards,\n  title = {Punished by Rewards},\n  author = {Kohn, Alfie},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\7EL9X7H7\\Kohn - Punished by rewards.pdf}\n}\n\n@article{krollCanArchitectureBe1981,\n  title = {Can {{Architecture}} Be {{Taught}}?},\n  author = {Kroll, Lucien and Mikellides, Byron},\n  year = {1981},\n  month = sep,\n  journal = {Journal of Architectural Education},\n  volume = {35},\n  number = {1},\n  pages = {36--39},\n  issn = {1046-4883, 1531-314X},\n  doi = {10.1080/10464883.1981.10758275},\n  urldate = {2023-09-10},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\JTYY52UF\\Kroll e Mikellides - 1981 - Can Architecture be Taught.pdf}\n}\n\n@article{lallyPromotingHabitFormation2013,\n  title = {Promoting Habit Formation},\n  author = {Lally, Phillippa and Gardner, Benjamin},\n  year = {2013},\n  month = may,\n  journal = {Health Psychology Review},\n  volume = {7},\n  number = {sup1},\n  pages = {S137-S158},\n  issn = {1743-7199, 1743-7202},\n  doi = {10.1080/17437199.2011.603640},\n  urldate = {2023-09-04},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\8U2TAHHG\\Lally e Gardner - 2013 - Promoting habit formation.pdf}\n}\n\n@phdthesis{leiteFormarNaoInformar2007,\n  type = {{Doutorado em Estruturas Ambientais Urbanas}},\n  title = {{Formar n{\\~a}o {\\'e} informar: um percurso sens{\\'i}vel na forma{\\c c}{\\~a}o do arquiteto}},\n  shorttitle = {{Formar n{\\~a}o {\\'e} informar}},\n  author = {Leite, Maria De Jesus De Britto},\n  year = {2007},\n  month = mar,\n  address = {{S{\\~a}o Paulo}},\n  doi = {10.11606/T.16.2007.tde-27052010-132106},\n  urldate = {2023-09-28},\n  langid = {portuguese},\n  school = {Universidade de S{\\~a}o Paulo},\n  file = {E:\\Zotero\\storage\\7NV27FTU\\formar.pdf}\n}\n\n@book{leitnerPatternTheoryIntroduction2015,\n  title = {Pattern Theory: Introduction and Perspectives on the Tracks of {{Christopher Alexander}}},\n  shorttitle = {Pattern Theory},\n  author = {Leitner, Helmut},\n  year = {2015},\n  edition = {First printing},\n  publisher = {{Helmut Leitner, HLS Software}},\n  address = {{Graz}},\n  isbn = {978-1-5056-3743-4},\n  langid = {english},\n  annotation = {OCLC: 913795677},\n  file = {E:\\Zotero\\storage\\CNC9R3JS\\Leitner - 2015 - Pattern theory introduction and perspectives on t.pdf}\n}\n\n@book{LinguagemConeceitoChaveEm2021,\n  title = {{Linguagem: Coneceito-Chave Em Filosofia}},\n  shorttitle = {{Linguagem}},\n  year = {2021},\n  month = nov,\n  publisher = {{Artmed}},\n  isbn = {978-85-363-0914-9},\n  langid = {brazilian}\n}\n\n@book{mehaffyDesignLivingPlanet2015,\n  title = {Design for a {{Living Planet}}: {{Settlement}}, {{Science}}, \\&amp; the {{Human Future}}},\n  shorttitle = {Design for a {{Living Planet}}},\n  author = {Mehaffy, Michael and Salingaros, Nikos and Salingaros, Nikos and Salingaros, Nikos and Salingaros, Nikos and Salingaros, Nikos},\n  year = {2015},\n  series = {Design for a {{Living Planet}}: {{Settlement}}, {{Science}}, \\&amp; the {{Human Future}}},\n  pages = {175--179},\n  publisher = {{Levellers/Sustasis Press and Vajra Publications}},\n  issn = {978-0989346955},\n  isbn = {978-0-9893469-5-5},\n  note = {O processo de desenvolvimento urbano na am{\\'e}rica latina se desenvolve atrav{\\'e}s de dois modelos distintos que, hora coexistem, hora competem entre si. Um deles ocorre atrav{\\'e}s da autoconstru{\\c c}{\\~a}o e da produ{\\c c}{\\~a}o informal do espa{\\c c}o. O outro {\\'e} fruto de uma abordagem mais estrutural tomada pelo governo.\n\\par\n``O primeiro {\\'e} cheio de vida, mas pode ser pobre e insalubre, enquanto o {\\'u}ltimo {\\'e} limpo e eficiente, mas est{\\'e}ril. Uma destas duas morfologias urbanas contrastantes pode ganhar sobre a outra, ou elas podem, juntas, alcan{\\c c}ar algum tipo de equil{\\'i}brio de coexist{\\^e}ncia (como tem ocorrido na maior parte da Am{\\'e}rica Latina). No movimento de autoconstru{\\c c}{\\~a}o, os governos aceitam que os moradores ir{\\~a}o construir suas pr{\\'o}prias casas e prov{\\^e} os materiais e treinamento para ajudar a estabelecer as redes de eletricidade, {\\'a}gua e esgotos.''},\n  file = {E:\\Zotero\\storage\\E366XJX8\\az-cf-172570.html}\n}\n\n@article{mehaffyPatternsGrowthOperationalizing2023,\n  title = {Patterns of {{Growth}}: {{Operationalizing Alexander}}'s ``{{Web Way}} of {{Thinking}}''},\n  shorttitle = {Patterns of {{Growth}}},\n  author = {Mehaffy, Michael W.},\n  year = {2023},\n  month = may,\n  journal = {Urban Planning},\n  volume = {8},\n  number = {3},\n  issn = {2183-7635},\n  doi = {10.17645/up.v8i3.6688},\n  urldate = {2023-09-08},\n  abstract = {Christopher Alexander was often characterized{\\textemdash}and sometimes seemed to characterize himself{\\textemdash}as ``sui generis,'' a radical and perhaps even eccentric thinker on architecture, technology, culture, and nature. That perception in turn has led many to dismiss Alexander's work as too idiosyncratic to be operationalized in the pragmatic world of planning and building. Here we show, however, that Alexander's core ideas have strong parallels in contemporary network science, mathematics, physics, and philosophy, and in the pragmatic world of technological design (including computer software). We highlight a remaining gap in translating Alexander's work into practical tools and strategies for implementation{\\textemdash}a gap that is tantalizingly near to being bridged.},\n  langid = {english},\n  note = {``In The Death and Life of Great American Cities, she noted that ``in creating city success, we humans have created marvels, but we left out feedback. What can we do with cities to make up for this omission?'' (Jacobs, 1961, p. 252)'' (Mehaffy, 2023, p. 241)\n\\par\n``Ao criar o sucesso nas cidades, n{\\'o}s, seres humanos, fazemos coisas maravilhosas, mas deixamos de lado a retroalimenta{\\c c}{\\~a}o. O'' (``Morte E Vida De Grandes Cidades'', 2022, p. 173)},\n  file = {E:\\Zotero\\storage\\TQ85QFN6\\Mehaffy - 2023 - Patterns of Growth Operationalizing Alexander’s “.pdf}\n}\n\n@article{munozVIVIENDACONPERSPECTIVA2022,\n  title = {{VIVIENDA CON PERSPECTIVA FEMINISTA}},\n  author = {Mu{\\~n}oz, Javiera and Rojas, Gloria and Silva, Constanza},\n  year = {2022},\n  langid = {spanish},\n  file = {E:\\Zotero\\storage\\XX5NL5LB\\Muñoz et al. - 2022 - VIVIENDA CON PERSPECTIVA FEMINISTA.pdf}\n}\n\n@misc{museumofpopcultureArchitectGardenerGeorge2019,\n  title = {The {{Architect}} and the {{Gardener}}: {{George R}}. {{R}}. {{Martin}} on {{Writing Game}} of {{Thrones}}},\n  shorttitle = {The {{Architect}} and the {{Gardener}}},\n  author = {{Museum of Pop Culture}},\n  year = {2019},\n  urldate = {2023-11-25},\n  abstract = {``I always knew they were summer snows. Why did I know that? But I knew that right from the beginning.''  In today's MoPOP Short, get a peek into the creative journey of GAME OF THRONES author George R.R. Martin with this clip from MoPOP's oral histories.}\n}\n\n@article{NewUrbanismDesigning,\n  title = {New Urbanism and beyond : Designing Cities for the Future},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\LWKGUXNQ\\New urbanism and beyond  designing cities for the.pdf}\n}\n\n@misc{NextJsBlog2020,\n  title = {Next.Js {{Blog Starter Kit}}},\n  year = {2020},\n  month = dec,\n  journal = {Next.js Blog Starter Kit},\n  urldate = {2023-11-23},\n  abstract = {Clone and deploy your own Next.js portfolio in minutes.},\n  howpublished = {https://jessems.com/posts/2020-12-19-a-city-is-not-a-tree},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\JTUB4QBB\\2020-12-19-a-city-is-not-a-tree.html}\n}\n\n@article{oakleyMindNumbers,\n  title = {A {{Mind For Numbers}}},\n  author = {Oakley, Barbara},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\PY9DVZ8A\\Oakley - A Mind For Numbers.pdf}\n}\n\n@misc{OurBirthright2016,\n  title = {Our {{Birthright}}},\n  year = {2016},\n  month = oct,\n  journal = {Building Beauty},\n  urldate = {2024-05-03},\n  abstract = {[W]hen I talk to politicians, to townspeople, to developers, when I watch the reaction in the newspapers, when I observe the studied (and to me frightening) neutrality of the journalist preparing to write his story, the most frightening thing of all is the loss that people have of their own feeling{\\ldots}},\n  howpublished = {https://www.buildingbeauty.org/resource-center-entries/2016/10/26/our-birthright},\n  langid = {american}\n}\n\n@misc{PatternLanguageCom,\n  title = {{{PatternLanguage}}.Com},\n  urldate = {2023-11-15},\n  howpublished = {https://www.patternlanguage.com/ca/ca.html},\n  note = {\\emph{A Pattern Language}~was perhaps the first complete book ever written in hypertext fashion.\n\\par\n(``PatternLanguage.com'')}\n}\n\n@misc{PatternLanguageComa,\n  title = {{{PatternLanguage}}.Com},\n  urldate = {2024-04-11},\n  howpublished = {https://www.patternlanguage.com/sequences/otherinfo/construction-contract.html},\n  file = {E:\\Zotero\\storage\\D8GWMS4W\\construction-contract.html}\n}\n\n@misc{PatternLanguageComb,\n  title = {{{PatternLanguage}}.Com},\n  urldate = {2024-04-11},\n  howpublished = {https://www.patternlanguage.com/sequences/sequences.html},\n  file = {E:\\Zotero\\storage\\V7TG5TP4\\sequences.html}\n}\n\n@misc{PatternLanguageComc,\n  title = {{{PatternLanguage}}.Com},\n  urldate = {2024-04-11},\n  howpublished = {https://www.patternlanguage.com/sequences/sequences.html},\n  file = {E:\\Zotero\\storage\\JFTHR2ND\\sequences.html}\n}\n\n@misc{PatternProjectLanguages2018,\n  title = {Pattern and {{Project Languages}}},\n  year = {2018},\n  month = jan,\n  journal = {Building Beauty},\n  urldate = {2024-05-03},\n  abstract = {From a lecture by Chris Andrews for Building Beauty  December 21, 2017   What are patterns? What is a pattern language? How are pattern languages helpful in building projects?   Download the slides:   Patterns and Project Languages   (10mb PDF file)},\n  howpublished = {https://www.buildingbeauty.org/resource-center-entries/2018/01/28/pattern-and-project-languages},\n  langid = {american},\n  file = {E:\\Zotero\\storage\\7GPUCI9J\\pattern-and-project-languages.html}\n}\n\n@misc{permasolutionsChristopherAlexanderLecture2012,\n  title = {Christopher {{Alexander Lecture}} at {{Berkeley}}, {{California}}},\n  author = {{Permasolutions}},\n  year = {2012},\n  urldate = {2023-09-15},\n  abstract = {Christopher Alexander Lecture at Berkeley, California}\n}\n\n@book{pinkerLanguageInstinctHow2000,\n  title = {The Language Instinct: How the Mind Creates Language},\n  shorttitle = {The Language Instinct},\n  author = {Pinker, Steven},\n  year = {2000},\n  publisher = {{Harperperennial}},\n  address = {{New York}},\n  isbn = {978-0-06-095833-6},\n  langid = {english},\n  lccn = {401.9},\n  file = {E:\\Zotero\\storage\\L5PHTML6\\The language instinct 1995 -- Pinker Steven -- d34f47a781b09fa2a3f3c5e18657e452 -- Anna’s Archive.pdf}\n}\n\n@article{pittaHumboldtHeideggerSobre,\n  title = {{Humboldt e Heidegger sobre linguagem: express{\\~a}o do esp{\\'i}rito ou morada do ser?}},\n  author = {Pitta, Maur{\\'i}cio Fernando},\n  volume = {7},\n  abstract = {From considerations made by Martin Heidegger at the conference A way to language (1959) on Wilhelm von Humboldt's conception of language, expressed in On language: the diversity of human language-structure and its influence on the mental development of mankind (1836), one proposes to explicit in more details in the present study assumptions on the Humboldtian understanding about the topic in order to clarify the ground of the also here exposed Heideggerian critique, making by contrast more manifest his own understanding. For Humboldt, language has the role of expression, as constant activity of the spirit (energeia); for Heidegger, on the other hand, it assumes step as place of beings revelation (aletheia), as ``house of Being'', originally allowing human beings the possibility of its own discourse. Going deeper in the argumentation of both theorists, one has in mind to explore the theoretical dispute with the purpose of pointing to some implications the ontological and epistemological backgrounds of Humboldt and Heidegger have, each in its own way, on the notion of language.},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\VU7N5G8M\\Pitta - Humboldt e Heidegger sobre linguagem expressão do.pdf}\n}\n\n@misc{PoeticPatternLanguage,\n  title = {Poetic {{Pattern Language}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/actions/poeticpl.htm},\n  file = {E:\\Zotero\\storage\\UYCC3YVD\\poeticpl.html}\n}\n\n@book{prodanovMetodologiaTrabalhoCientifico2012,\n  title = {{Metodologia do trabalho cient{\\'i}fico: m{\\'e}todos e t{\\'e}cnicas da pesquisa e do trabalho acad{\\^e}mico}},\n  shorttitle = {{Metodologia do trabalho cient{\\'i}fico}},\n  author = {Prodanov, Cleber Cristiano},\n  year = {2012},\n  month = dec,\n  publisher = {{Universidade Feevale}},\n  collaborator = {de Freitas, Ernani Cesar},\n  isbn = {978-85-7717-158-3},\n  langid = {portuguese},\n  keywords = {Ci{\\^e}ncias sociais},\n  file = {E:\\Zotero\\storage\\SR9DNARZ\\Prodanov - 2012 - Metodologia do trabalho científico métodos e técn.pdf}\n}\n\n@article{queirozEXPERIMENTOCOMESCOLA,\n  title = {{O EXPERIMENTO COM A ESCOLA DE M{\\'U}SICA DA U.BA}},\n  author = {Queiroz, Marcos},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\IVMQENZE\\Queiroz - O EXPERIMENTO COM A ESCOLA DE MÚSICA DA U.BA.pdf}\n}\n\n@phdthesis{reginamartinipaulabarrosHabitacaoColetivaInclusao2008,\n  type = {{Doutor em Engenharia Civil}},\n  title = {{Habita{\\c c}{\\~a}o coletiva: a inclus{\\~a}o de conceitos humanizadores no processo de projeto}},\n  shorttitle = {{Habita{\\c c}{\\~a}o coletiva}},\n  author = {Regina Martini Paula Barros, Raquel},\n  year = {2008},\n  month = oct,\n  address = {{Campinas, SP}},\n  doi = {10.47749/T/UNICAMP.2008.434038},\n  urldate = {2023-08-28},\n  langid = {portuguese},\n  school = {Universidade Estadual de Campinas},\n  note = {``A~ presente~ pesquisa~ considera~ que~ a~ complexidade~ da~ linguagem~ de~ par{\\^a}metros~ original~ em~ Alexander~ et~ al.~ (1977),~ embora~ real,~ n{\\~a}o~ se~ encontra~ suficientemente~ evidenciada~ naquela~ obra,~ que~ os~ apresenta~ mais~ como~ cole{\\c c}{\\~a}o~ do~ que~ como~ sistema'' (Regina Martini Paula Barros, 2008, p. 177)\n\\par\n``Criar~ UHs~ que~ ofere{\\c c}am~ adequa{\\c c}{\\~a}o~ ao~ uso~ --~ lembrando~ que~ as~ atividades~ devem~ guiar~ a~ estrutura~ f{\\'i}sica~ e~ n{\\~a}o~ o~ contr{\\'a}rio'' (Regina Martini Paula Barros, 2008, p. 108)\n\\par\nPara construir o sentido de lar:},\n  file = {E:\\Zotero\\storage\\994AFM8E\\Regina Martini Paula Barros - 2008 - Habitação coletiva a inclusão de conceitos humani.pdf}\n}\n\n@article{ribeiroMorteLinguagemNo2017,\n  title = {{Morte e linguagem no conto ``A hora e a vez de Augusto Matraga''}},\n  author = {Ribeiro, Gl{\\'o}ria Maria Ferreira},\n  year = {2017},\n  month = sep,\n  journal = {Aufkl{\\\"a}rung: journal of philosophy},\n  volume = {4},\n  pages = {59--68},\n  issn = {23189428},\n  doi = {10.18012/arf.2016.35901},\n  urldate = {2023-07-09},\n  abstract = {The present work aims to investigate the phenomenon of death and its relation with the poetic word in the tale ``The Hour andTurn of Augusto Matraga'' written by Jo{\\~a}o Guimar{\\~a}es Rosa (1908\\-1967). For this investigation, the background thinker will be Martin Heidegger (1889\\-1976) whose writings on language, dated between the years of 1950\\- 58, are able to give the right guid an our interpretation.},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\UHB97NCF\\Ribeiro - 2017 - Morte e linguagem no conto “A hora e a vez de Augu.pdf}\n}\n\n@misc{RulesThumbAdaptive2021,\n  title = {Rules of {{Thumb}} and {{Adaptive Rationality}}},\n  year = {2021},\n  month = nov,\n  urldate = {2024-06-29},\n  abstract = {Rules of Thumb and Adaptive Rationality Human cultures have used rules of thumb for centuries. During the past century, however, they have been vilified to near extinction. Is their demise justified? Roope Kaaronen Photo by Adam Rhodes Author: Roope Kaaronen Affiliation: Postdoctoral researcher, University of Helsinki Twitter: @RoopeKaaronen Date: November 4, 2021 Rules of thumb are simple and practical cognitive shortcuts that make use of bodily and environmental features. Human cultures have used rules of thumb for centuries to guide agriculture, technological development, and other aspects of social life. During the past century, however, rules of thumb have been vilified},\n  howpublished = {https://thesideview.co/journal/rules-of-thumb-and-adaptive-rationality/},\n  langid = {american},\n  file = {E:\\Zotero\\storage\\4U294WSQ\\rules-of-thumb-and-adaptive-rationality.html}\n}\n\n@article{ryleSystematicallyMisleadingExpressions1932,\n  title = {Systematically {{Misleading Expressions}}},\n  author = {Ryle, G.},\n  year = {1932},\n  journal = {Proceedings of the Aristotelian Society, New Series},\n  volume = {3},\n  eprint = {4544203},\n  eprinttype = {jstor},\n  pages = {139--170},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\YI64I3AE\\Ryle - 1932 - Systematically Misleading Expressions.pdf}\n}\n\n@article{salingarosBIOPHILIAHEALINGENVIRONMENTS2015,\n  title = {{{BIOPHILIA}} \\& {{HEALING ENVIRONMENTS}}},\n  author = {Salingaros, Nikos A},\n  year = {2015},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\SEWKD7X3\\Salingaros - 2015 - BIOPHILIA & HEALING ENVIRONMENTS.pdf}\n}\n\n@article{salingarosDarwinianProcessesMemes2002,\n  title = {Darwinian {{Processes}} and {{Memes}} in {{Architecture}}: {{A Memetic Theory}} of {{Modernism}}},\n  shorttitle = {Darwinian {{Processes}} and {{Memes}} in {{Architecture}}},\n  author = {Salingaros, Nikos},\n  year = {2002},\n  journal = {Journal of Memetics - Evolutionary Models of Information Transmission},\n  series = {{{ATOA}}},\n  volume = {6},\n  number = {1},\n  issn = {3-937954-07-4},\n  isbn = {9783937954073},\n  file = {E:\\Zotero\\storage\\MVMSD3UP\\az-cf-172632.html}\n}\n\n@article{salingarosPATTERNSARCHITECTURE,\n  title = {{{THE PATTERNS OF ARCHITECTURE}}},\n  author = {Salingaros, Nikos A},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\U5FY24KT\\Salingaros - THE PATTERNS OF ARCHITECTURE.pdf}\n}\n\n@article{salingarosStructurePatternLanguages2000,\n  title = {The Structure of Pattern Languages},\n  author = {Salingaros, Nikos A.},\n  year = {2000},\n  month = jun,\n  journal = {Architectural Research Quarterly},\n  volume = {4},\n  number = {2},\n  pages = {149--162},\n  issn = {1359-1355, 1474-0516},\n  doi = {10.1017/S1359135500002591},\n  urldate = {2023-08-28},\n  abstract = {Pattern languages help us to tackle the complexity of a wide variety of systems ranging from computer software, to buildings and cities. Each \"pattern\" represents a rule governing one working piece of a complex system, and the application of pattern languages can be done systematically. Design that wishes to connect to human beings needs the information contained in a pattern language. This paper describes how to validate existing pattern languages, how to develop them, and how they evolve. The connective geometry of urban interfaces is derived from the architectural patterns of Christopher Alexander.},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\8EMTY2RL\\Salingaros - 2000 - The structure of pattern languages.pdf}\n}\n\n@article{salingarosTheoryArchitecture,\n  title = {A {{Theory}} of {{Architecture}}},\n  author = {Salingaros, Nikos A},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\EZAXP4B3\\Salingaros - A Theory of Architecture.pdf}\n}\n\n@book{salingarosTheoryArchitecture2006,\n  title = {A {{Theory}} of {{Architecture}}},\n  author = {Salingaros, Nikos},\n  year = {2006},\n  series = {{{ATOA}}},\n  publisher = {{Umbau-Verlag}},\n  address = {{Solingen, Germany}},\n  issn = {3-937954-07-4},\n  isbn = {978-3-937954-07-3},\n  file = {E:\\Zotero\\storage\\9E4YRFPX\\az-cf-172616.html}\n}\n\n@article{schlickFUTUROFILOSOFIA,\n  title = {{O FUTURO DA FILOSOFIA}},\n  author = {Schlick, Moritz},\n  journal = {Moritz Schlick},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\XR79MDGW\\Schlick - O FUTURO DA FILOSOFIA.pdf}\n}\n\n@article{simonINVARIANTSHUMANBEHAVIOR,\n  title = {{{INVARIANTS OF HUMAN BEHAVIOR}}!},\n  author = {Simon, A},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\4KZUH944\\Simon - INVARIANTS OF HUMAN BEHAVIOR!.pdf}\n}\n\n@article{souzadeandradeSantaLuziaResiste2021,\n  title = {Santa {{Luzia}} Resiste: {{Processo}} Participativo e Padr{\\~o}es Espaciais Para Elabora{\\c c}{\\~a}o Do {{Plano}} de {{Bairro}} e Do {{Projeto}} de {{Habita{\\c c}{\\~a}o}} Das {{Mulheres Poderosas}}.},\n  shorttitle = {Santa {{Luzia}} Resiste},\n  author = {Souza De Andrade, Liza Maria and Fanny Lenoir, Juliette Anna and De Freitas Portugal, Sofia and Rezende Fialho, {\\'A}tila},\n  year = {2021},\n  month = jan,\n  journal = {Parano{\\'a}: cadernos de arquitetura e urbanismo},\n  number = {29},\n  issn = {1679-0944, 1677-7395},\n  doi = {10.18830/issn.1679-0944.n29.2021.02},\n  urldate = {2023-09-28},\n  abstract = {Este trabalho tem como objetivo demonstrar os processos participativos, a elabora{\\c c}{\\~a}o e a sistematiza{\\c c}{\\~a}o de padr{\\~o}es espaciais baseados em Alexander et al. (1977) e Andrade (2014), considerando as dimens{\\~o}es da sustentabilidade para constru{\\c c}{\\~a}o do Plano de Bairro de Santa Luzia e do Projeto Habitacional das Mulheres Poderosas desenvolvidos pelo Grupo de Pesquisa e Extens{\\~a}o Perif{\\'e}rico como alternativa {\\~A}~ proposta da Companhia de Desenvolvimento Habitacional ''`` CODHAB. Santa Luzia {\\'e} uma ocupa{\\c c}{\\~a}o urbana de 20 mil habitantes na Cidade Estrutural sem infraestrutura b{\\'a}sica, na regi{\\~a}o onde havia o antigo Lix{\\~a}o que contribuiu para o progressivo aumento da popula{\\c c}{\\~a}o de catadores na faixa de tamponamento de 300 metros da {\\'A}rea de Relevante Interesse Ecol{\\'o}gico, criada posteriormente {\\~A}~ ocupa{\\c c}{\\~a}o urbana, nas bordas do Parque Nacional de Bras{\\'i}lia. Para resolver os conflitos socioambientais a CODHAB desenvolveu um projeto habitacional que prev{\\^e} 4 lajes sobrepostas ao longo de 3,2 quil{\\^o}metros para receber cerca de 2400 unidades habitacionais. No entanto, a popula{\\c c}{\\~a}o n{\\~a}o se sente contemplada, principalmente considerando as remo{\\c c}{\\~o}es de moradias de alvenaria, caracterizadas pela autoconstru{\\c c}{\\~a}o e padr{\\~o}es urbanos org{\\^a}nicos emergentes. Os resultados do Plano de Bairro e do Projeto Habitacional elaborados em conjunto com a popula{\\c c}{\\~a}o refor{\\c c}am a riqueza do desenho dos padr{\\~o}es espaciais e de acontecimentos existentes, e prop{\\~o}em solu{\\c c}{\\~o}es mais sustent{\\'a}veis com hierarquia vi{\\'a}ria, infraestrutura ecol{\\'o}gica e parque linear para fixa{\\c c}{\\~a}o da popula{\\c c}{\\~a}o.},\n  file = {E:\\Zotero\\storage\\5NVQNRCT\\2-Santa luzia resiste.pdf}\n}\n\n@misc{stanfordAnalogyCoreCognition2009,\n  title = {Analogy as the {{Core}} of {{Cognition}}},\n  author = {{Stanford}},\n  year = {2009},\n  urldate = {2023-09-17},\n  abstract = {In this Presidential Lecture, cognitive scientist Douglas Hofstadter examines the role and contributions of analogy in cognition, using a variety of analogies to illustrate his points.     Stanford University:  http://www.stanford.edu/    Stanford Humanities Center:  http://shc.stanford.edu/    Stanford University Channel on YouTube:  ~~~/~stanford}\n}\n\n@misc{SteynViljoenCity,\n  title = {Steyn {{Viljoen}} {\\textbullet} {{A City}} Is {{Not}} a {{Tree}} | {{Summary}} 🌳},\n  urldate = {2023-11-23},\n  abstract = {My summary of Christopher Alexander's \"A city is not a tree\" paper:},\n  howpublished = {https://www.viljoen.space/writing/a-city-is-not-a-tree},\n  file = {E:\\Zotero\\storage\\HW35VEI9\\a-city-is-not-a-tree.html}\n}\n\n@misc{STMARKS,\n  title = {{{STMARKS}}},\n  urldate = {2024-04-10},\n  howpublished = {https://www.livingneighborhoods.org/unfoldingmovies/stmarks/stmarks-final.htm},\n  file = {E:\\Zotero\\storage\\ZRFH8H6M\\stmarks-final.html}\n}\n\n@misc{sustasiscollaborativeUnifiedArchitecturalTheory2021,\n  title = {Unified {{Architectural Theory}}, {{Lecture}} 2: {{Form Languages}} and {{Pattern Languages}}},\n  shorttitle = {Unified {{Architectural Theory}}, {{Lecture}} 2},\n  author = {{Sustasis Collaborative}},\n  year = {2021},\n  month = jan,\n  urldate = {2023-09-15},\n  abstract = {Welcome to the second of a lecture series, ``Form, Language, Complexity: Unified Architectural Theory''. This is Lecture 2: ``Form Languages and Pattern Languages'', by Nikos A. Salingaros, Professor of Mathematics and Architecture at The University of Texas at San Antonio.  Included: Form language as the basis for a theory of architecture. Requirements for a form language to generate an adaptive architecture. Relationship between form language and pattern language. Texts discussed: Christopher Alexander (2001) The Nature of Order, Book 1: The Phenomenon of Life, Center for Environmental Structure, Berkeley, California. Buy in the USA from: https://www.oxbowbooks.com/dbbc/the-n... and internationally from: https://www.eurospanbookstore.com/the... or from any online bookstore.  Nikos Salingaros (2013) Unified Architectural Theory: Form, Language, Complexity, Sustasis Press, Portland, Oregon. Buy the paper book from the publisher in the USA:  https://www.levellerspress.com/produc... European edition:  https://www.mijnbestseller.nl/shop/in... Asian Edition:  https://www.vajrabookshop.com/categor... This book is available in several other languages (so far, Arabic, Czech, German, Nepali, Spanish, and Urdu), and also as an eBook in English. Some chapters (shortened) are posted online on ArchDaily in several languages:  https://applied.math.utsa.edu/{\\textasciitilde}yxk833... Readings for Lecture 2: Alexander, The Phenomenon of Life, Chapter 2.  Salingaros, Chapter 7 of Unified Architectural Theory:  https://www.archdaily.com/447456/unif... Alexander, sampler from ``A Pattern Language'':  http://www.patternlanguage.com/apl/ap... Mehaffy et al., extracts from ``A New Pattern Language'':  https://patterns.architexturez.net/do... Salingaros, ``Two languages for architecture'' (from ATOA). 1. Pattern Language vs. Form Language:  https://www.archdaily.com/488929/a-th... 2. The Adaptive Design Method:  https://www.archdaily.com/491122/a-th... 3. Why Primitive Form Languages Spread:  https://www.archdaily.com/493458/a-th...}\n}\n\n@misc{sustasiscollaborativeUnifiedArchitecturalTheory2021a,\n  title = {Unified {{Architectural Theory}}, {{Lecture}} 1: {{The Structure}} of {{Architectural Theories}}},\n  shorttitle = {Unified {{Architectural Theory}}, {{Lecture}} 1},\n  author = {{Sustasis Collaborative}},\n  year = {2021},\n  month = jan,\n  urldate = {2023-09-15},\n  abstract = {Welcome to the first of a lecture series, \"Form, Language, Complexity: Unified Architectural Theory.\"  This is Lecture 1: \"The Structure of Architectural Theories,\" by Nikos A. Salingaros, Professor of Mathematics and Architecture, at The University of Texas at San Antonio.  Included: The structure of a scientific theory. Requirements for a mode of thought to be a theory for architecture. Discourses and modes of thought are not theories. Texts discussed: Christopher Alexander (2001) The Nature of Order, Book 1: The Phenomenon of Life, Center for Environmental Structure, Berkeley, California. Buy in the USA from: https://www.oxbowbooks.com/dbbc/the-n... and internationally from: https://www.eurospanbookstore.com/the... or from any online bookstore.  Nikos Salingaros (2013) Unified Architectural Theory: Form, Language, Complexity, Sustasis Press, Portland, Oregon. Buy the paper book from the publisher in the USA:  https://www.levellerspress.com/produc... European edition:  https://www.mijnbestseller.nl/shop/in... Asian Edition:  https://www.vajrabookshop.com/categor... It is available in several other languages, and also as an eBook in English. Some chapters (shortened) are posted online on ArchDaily in several languages: https://applied.math.utsa.edu/{\\textasciitilde}yxk833... Readings for Lecture 1: Alexander, The Phenomenon of Life, Prologue \\& Chapter 1. Salingaros, Chapter 4 of Unified Architectural Theory:  https://www.archdaily.com/429404/unif... Salingaros, ``Architectural Theory'' extract I and extract II from AAAD: https://www.archdaily.com/433898/unif... https://www.archdaily.com/439498/unif...  E. O. Wilson, ``Integrated Science and the Coming Century of the Environment'', Science, Volume 279, No. 5359 (March 27 1998), pages 2048-2049: https://science.sciencemag.org/conten...}\n}\n\n@misc{sustasiscollaborativeUnifiedArchitecturalTheory2021b,\n  title = {Unified {{Architectural Theory}}, {{Lecture}} 3: {{Complex}} versus Simplistic Form Languages},\n  shorttitle = {Unified {{Architectural Theory}}, {{Lecture}} 3},\n  author = {{Sustasis Collaborative}},\n  year = {2021},\n  urldate = {2023-10-22},\n  abstract = {Welcome to the third of a lecture series, ``Form, Language, Complexity: Unified Architectural Theory''. This is Lecture 3: ``Complex versus simplistic form languages'', by Nikos A. Salingaros, Professor of Mathematics and Architecture at The University of Texas at San Antonio.  Included: Vocabulary of forms and tectonics, and their combinatorial properties. Richness of a form language, and measures of its complexity. Different examples of Form Languages. Classical, historical, regional, etc. Industrial-era form languages. Form languages of famous architects. Readings for Lecture 3: Alexander, The Phenomenon of Life, Chapter 7.  Dave Hora, Nature of Order Lecture 1.  http://www.archnewsnow.com/features/F... Salingaros, Three Laws of Structural Order (from ATOA). http://citeseerx.ist.psu.edu/viewdoc/... Salingaros, Chapter 8 of Unified Architectural Theory:  https://www.archdaily.com/509721/unif... Salingaros \\& Masden, Against Ecophobia (included as Chapter 10 of Unified Architectural Theory). https://www.archdaily.com/512714/unif... Salingaros \\& Masden, Politics, Philosophy, and Critical Theory (included as Chapter 13 of Unified Architectural Theory). http://cdnimd.worldarchitecture.org/d... *** Texts discussed:  Christopher Alexander (2001) The Nature of Order, Book 1: The Phenomenon of Life, Center for Environmental Structure, Berkeley, California. Buy in the USA from: https://www.oxbowbooks.com/dbbc/the-n... and internationally from: https://www.eurospanbookstore.com/the... or from any online bookstore.  Nikos Salingaros (2013) Unified Architectural Theory: Form, Language, Complexity, Sustasis Press, Portland, Oregon. Buy the paper book from the publisher in the USA:  https://www.levellerspress.com/produc... European edition:  https://www.mijnbestseller.nl/shop/in... Asian Edition:  https://www.vajrabookshop.com/categor... This book is available in several other languages (so far, Arabic, Czech, German, Nepali, Spanish, and Urdu), and also as an eBook in English. Some chapters (shortened) are posted online on ArchDaily in several languages:  https://applied.math.utsa.edu/{\\textasciitilde}yxk833...}\n}\n\n@misc{TheoryArchitecturePart2014,\n  title = {A {{Theory}} of {{Architecture Part}} 1: {{Pattern Language}} vs. {{Form Language}}},\n  shorttitle = {A {{Theory}} of {{Architecture Part}} 1},\n  year = {2014},\n  month = mar,\n  journal = {ArchDaily},\n  urldate = {2023-09-15},\n  abstract = {As you may have seen, ArchDaily has been publishing UNIFIED ARCHITECTURAL THEORY, by the urbanist and controversial t...},\n  howpublished = {https://www.archdaily.com/488929/a-theory-of-architecture-part-1-pattern-language-vs-form-language},\n  langid = {american},\n  note = {Architectural design is a highly complex undertaking. Heretofore, the processes at its base have not been made clear. There have been many attempts to clarify the design process, yet we still don't have a design method that can be used by students and novices to achieve practical, meaningful, nourishing, human results.~\n\\par\nLearn to apply languages to form an architectural design is a rather difficult endeavor. It is not clear how to teach students this patterns to clarify the design process. \n\\par\nA form language is a set of evolved geometries on many different scales (i.e., ornamental, building, urban) that people of a particular culture identify with, and are comfortable with. It is highly dependent on traditional and local materials {\\textemdash} at least that was the case before the global introduction of nonspecific industrial materials.~\n\\par\nnon specific materials introduced with globalization leads to apply (as site specific) cultural specific materials. \n\\par\nGlobalization should have enhanced the transmission of patterns, why that doesn't happen?},\n  file = {E:\\Zotero\\storage\\MIGCV795\\a-theory-of-architecture-part-1-pattern-language-vs-form-language.html}\n}\n\n@article{tillFlexibleHousingMeans2005,\n  title = {Flexible Housing: The Means to the End},\n  shorttitle = {Flexible Housing},\n  author = {Till, Jeremy and Schneider, Tatjana},\n  year = {2005},\n  month = sep,\n  journal = {arq: Architectural Research Quarterly},\n  volume = {9},\n  number = {3-4},\n  pages = {287},\n  issn = {1359-1355, 1474-0516},\n  doi = {10.1017/S1359135505000345},\n  urldate = {2023-08-28},\n  langid = {english},\n  note = {Final Page: The Deterministic Approach to tecnology. It becomes an end in itself. General approach in the XX century.},\n  file = {E:\\Zotero\\storage\\5ACCFFHU\\Till e Schneider - 2005 - Flexible housing the means to the end.pdf}\n}\n\n@book{tomaselloConstructingLanguageUsagebased2005,\n  title = {Constructing a Language: A Usage-Based Theory of Language Acquisition},\n  shorttitle = {Constructing a Language},\n  author = {Tomasello, Michael},\n  year = {2005},\n  edition = {1. Harvard Univ. Press paperback ed},\n  publisher = {{Harvard Univ. Press}},\n  address = {{Cambridge, Mass.}},\n  isbn = {978-0-674-01030-7 978-0-674-01764-1},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\ARP6BDBC\\Tomasello - 2005 - Constructing a language a usage-based theory of l.pdf}\n}\n\n@misc{tomaselloEvidenceRebutsChomsky2016,\n  title = {Evidence {{Rebuts Chomsky}}'s {{Theory}} of {{Language Learning}}},\n  author = {Tomasello, Michael, Paul Ibbotson},\n  year = {2016},\n  month = nov,\n  journal = {Scientific American},\n  urldate = {2023-12-13},\n  abstract = {Much of Noam Chomsky's revolution in linguistics{\\textemdash}including its account of the way we learn languages{\\textemdash}is being overturned},\n  howpublished = {https://www.scientificamerican.com/article/evidence-rebuts-chomsky-s-theory-of-language-learning/},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\K7VEUXBT\\evidence-rebuts-chomsky-s-theory-of-language-learning.html}\n}\n\n@misc{urhumanitiesprojectLanguageCreativityLimits2016,\n  title = {``{{Language}}, {{Creativity}}, and the {{Limits}} of {{Understanding}}'' by {{Professor Noam Chomsky}} (4-21-16)},\n  author = {{UR Humanities Project}},\n  year = {2016},\n  urldate = {2023-12-13},\n  abstract = {Professor Noam Chomsky public lecture: \"Language, Creativity, and the Limits of Understanding\" April 21, 2016 5:00 PM - 7:00 PM Interfaith Chapel Sanctuary University of Rochester The University of Rochester's Distinguished Visiting Humanist for the 2015-16 academic year will be Professor Noam Chomsky (Institute Professor \\& Professor of Linguistics, Emeritus, at MIT), who was in residence from Wednesday, April 20 through Friday, April 22, 2016. Professor Chomsky is one of the most influential thinkers and public intellectuals of our time, writing and speaking about everything from linguistics and the mind to the nature and cultural significance of power, force, exploitation, manipulation, the media, and just government. He was voted the leading living public intellectual in the 2005 Global Intellectuals Poll conducted by the British magazine Prospect, is a member of the American Academy of Arts and Sciences and the National Academy of Sciences, and has received honorary degrees from over 35 universities around the world. In 2011, he was awarded the Sydney Peace Prize.}\n}\n\n@misc{videolectureschannelMinimalistProgramLanguage2012,\n  title = {The Minimalist Program and Language Acquisition},\n  author = {{VideoLecturesChannel}},\n  year = {2012},\n  urldate = {2023-11-08},\n  abstract = {VideoLectures.Net Single Lectures Series  View the complete series: http://videolectures.net/single\\_lectu... Speaker: Noam Chomsky License: Creative Commons CC BY-NC-ND 3.0 More information at http://videolectures.net/site/about/ More talks at http://videolectures.net/ This talk was given in occasion of the Honorary Doctorate degree in Neuroscience awarded by the International School for Advanced Studies (SISSA) in Trieste, Italy on 17th September, 2012. The Minimalist Program is a linguistic theory which originated from an almost forty year long tradition of generative linguistics. It was conceived and was initiated by Noam Chomsky.}\n}\n\n@article{vrcibradicDebateEntreChristopher2018,\n  title = {{O Debate entre Christopher Alexander e Peter Eisenman Revisitado: Autonomia e Desarticula{\\c c}{\\~a}o Te{\\'o}rica na Arquitetura}},\n  author = {Vrcibradic, Petar},\n  year = {2018},\n  abstract = {This article intends to examine the debate held in November 17th, 1982 in the Graduate School of Design - Harvard University between Christopher Alexander and Peter Eisenman. The meeting is representative of a period (70's and 80's) when architectural morphology and repertoire are intensely debated in view of a crisis in the modernist statute. It is worth to highlight, as important precedents to the debate, both the establishment of design as field of scientific inquiry during the 1960's and the concurrent establishment of an ideology of practice based on the intellectual autonomy of the architect. The origins of these two phenomena are linked to the workings of two intellectual groups: the Design Methods Group and the Institute for Architecture and Urban Studies (IAUS). The previous associations to each of these groups, by Alexander and Eisenman respectively, refers {\\textendash} even if indirectly {\\textendash} to some of the theoretical instances held in this famous debate. The controversial tone of the encounter and the intensity of some of the refutations justifies, in part, the general understanding that Eisenmam and Alexander represent theoretical positions which are diametrically opposed. However, after some thirty five years it is possible, with the convenient suspension of momentary moods, to reassess the debate with an emphasis on its contents.},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\HUJUG8VI\\Vrcibradic - 2018 - O Debate entre Christopher Alexander e Peter Eisen.pdf}\n}\n\n@misc{WaybackMachine2020,\n  title = {Wayback {{Machine}}},\n  year = {2020},\n  month = sep,\n  urldate = {2024-03-25},\n  howpublished = {https://web.archive.org/web/20200926221414/http://www.livingneighborhoods.org/library/empirical-findings.pdf},\n  file = {E:\\Zotero\\storage\\JQAJSKXG\\2020 - Wayback Machine.pdf}\n}\n\n@misc{WhatLanguageWhy,\n  title = {\"{{What}} Is {{Language}} and {{Why Does It Matter}}\" - {{Noam Chomsky}} - {{YouTube}}},\n  urldate = {2023-11-25},\n  howpublished = {https://www.youtube.com/watch?v=-72JNZZBoVw\\&t=4616s},\n  file = {E:\\Zotero\\storage\\JIJ7WM3W\\watch.html}\n}\n\n@book{whiteheadProcessRealityEssay1978,\n  title = {Process and Reality: An Essay in Cosmology},\n  shorttitle = {Process and Reality},\n  author = {Whitehead, Alfred North and Griffin, David Ray and Sherburne, Donald W.},\n  year = {1978},\n  series = {Gifford Lectures},\n  edition = {Corrected ed},\n  number = {1927-28},\n  publisher = {{Free Press}},\n  address = {{New York}},\n  isbn = {978-0-02-934580-1},\n  langid = {english},\n  lccn = {BD511 .W5 1978},\n  keywords = {Cosmology,Organism (Philosophy),Philosophy,Science},\n  file = {E:\\Zotero\\storage\\5P8Z2L2U\\Whitehead et al. - 1978 - Process and reality an essay in cosmology.pdf}\n}\n\n@book{wittgensteinInvestigacoesFilosoficas2022,\n  title = {{Investiga{\\c c}{\\~o}es Filos{\\'o}ficas}},\n  author = {Wittgenstein, Ludwig},\n  translator = {R. L. De Almeida, Jo{\\~a}o Jos{\\'e}},\n  year = {2022},\n  month = mar,\n  edition = {1},\n  publisher = {{Horle Books}},\n  doi = {10.55872/GOUO4768},\n  urldate = {2023-11-21},\n  abstract = {German-Portuguese en face translation of the capital work of the later Wittgenstein.},\n  isbn = {9786599674211},\n  langid = {portuguese},\n  file = {E:\\Zotero\\storage\\G4IX3WME\\Wittgenstein - 2022 - Investigações Filosóficas.pdf}\n}\n\n@article{youngTenMentalModels,\n  title = {Ten {{Mental Models}} for {{Learning Anything}}},\n  author = {Young, Scott},\n  langid = {english},\n  file = {E:\\Zotero\\storage\\P3B87AXE\\Young - Ten Mental Models for Learning Anything.pdf}\n}\n\n@article{zavoleasPatternsNatureBiosystemic2021,\n  title = {Patterns of Nature: {{Bio-systemic}} Design Thinking in Meeting Sustainability Challenges of an Increasingly Complex World},\n  shorttitle = {Patterns of Nature},\n  author = {Zavoleas, Yannis},\n  year = {2021},\n  month = jul,\n  journal = {Developments in the Built Environment},\n  volume = {7},\n  pages = {100048},\n  issn = {2666-1659},\n  doi = {10.1016/j.dibe.2021.100048},\n  urldate = {2023-08-24},\n  abstract = {This present work weaves a thread between natural patterns and their systemic applications in architecture, urbanism and landscape design. To that end, computational approaches have greatly assisted the study of dynamic parameters describing natural phenomena, and in physical space design as input/output algorithmic operations bringing together data and expertise. Apart from its direct applications, computation signifies a concept about soft data management that was developed well before computers were introduced into practice. An interest in malleable patterns guiding design during late modernism was suggestive of alternative methods responding to socioecological aims. Patterns were no longer rigid geometric references imposed upon a scheme, but ones supporting complexity, mutation and evolution as in a bio-systemic context. These earlier endeavours may set the intellectual framing of recent advancements in computing, promoting architectural thinking as a comprehensive model of cross-scientific action in analogy with nature's synergistic functions.},\n  keywords = {Bio-systemic thinking,Computing,Dynamic pattern,Nature design,Sustainability},\n  file = {E\\:\\\\Zotero\\\\storage\\\\ZQT26L4C\\\\Zavoleas - 2021 - Patterns of nature Bio-systemic design thinking i.pdf;E\\:\\\\Zotero\\\\storage\\\\8T6B7DK8\\\\S2666165921000077.html}\n}\n",
    "type": "application/x-bibtex",
    "tmap.id": "7ed5b62a-5e0f-4030-bae1-3279892080a2",
    "revision": "1",
    "bag": "default"
}