{
    "created": "20250124231353161",
    "text": "<</img_intro>>\n\n<<diamantes>>\n\nProblema:\n\n<problema>\n\nReformas ocorrem até que não tenham que acontecer mais, o ritmo de mudanças em uma edificação decai conforme ela chega perto do seu apogeu. \n\n</problema>\n\n<<descricao\"\n\n> Conforme a construção chega a sua maturidade, seus incrementos se tornam menores. (Alexander,1977, p.487)\n\nReformas ocorrem até que não tenham que acontecer mais, o ritmo de mudanças em uma edificação decai conforme ela chega perto do seu apogeu. \n\nEm estruturas fabricadas, essas mudanças ocorrem em um único salto abrupto. Naquelas geradas, postergamos decisões importantes para o momento em que temos maior confiança, quando estamos certos de que aquela é mais adequada para aquele caso. \n\nAprendizado é um processo doloroso, também é desconfortável o momento das reformas para os moradores de uma casa. Tudo se mergulha em caos, barulho e sujeira, funções básicas são obstruídas e muita atenção, energia e dinheiro devem ser direcionados para sua conclusão. Por vezes a Carcaça da edificação se fragiliza, pessoas se machucam e a segurança da estrutura como um todo é comprometida. É como se o sistema imune da edificação estivesse sendo atacado nesse momento.\n\nPorém, o propósito dessa nota é nos dar esperança, afinal essas mudanças refletem o crescimento, e são por isso um mal necessário para que a casa se torne melhor adaptada as nossas necessidades. Conforme grandes decisões são tomadas, elas são menos requisitadas, embora seja bom manter a estrutura aberta para revisões, já que a [[Função derrete a Forma]].\n\nNão obstante existe um corrolário negativo. Assim como no Xadrêz, o número de possíveis movimentos decai vertijinosamente a cada turno, as decisões mais importantes do design são as primeiras. Sendo assim, como Gall sintetiza:\n\n>Um Design pobre não pode ser salvo com mais design.\n\nAs nossas primeiras decisões são as mais comprometedoras, e primeiras decisões ruins dificilmente podem ser salvas com ornamentos e detalhes superfluos no fim. Paradoxalmente, o [[Acabamento nunca acaba]], a implementação dos detalhes, que pareciam simples no papel, quase sempre se transformam em enormes dores de cabeça. \n\n\">>\n\nPortanto:\n\n<solucao>\n\nTalvez o melhor a se fazer seja conceber edificações através de um [[Enrijecimento Gradual]], que permite com que a estrutura seja maleável durante a construção, esperando até que tudo se encaixe em seu devido lugar.\n\n</solucao>\n\n<<diamantes>>\n\n<<mapa \"Live View\">>\n\nReferências:\n<footer>\n{{!!link_npl}}\n</footer>\n\n\n\n\n<footer>\n<<twb>>  \n<<hbl>>",
    "modified": "20250124232059875",
    "tags": "pessoal",
    "title": "Draft of 'Novo Padrão'",
    "tmap.id": "ffe6e4a9-63d6-404e-846b-32f6da67d491",
    "draft.title": "",
    "draft.of": "Novo Padrão"
}